{"低位码垛机": {"单元组成": {"text": "低位码垛控制系统组成框图如图1-1所示。各组成部分的作用如下：可编程控制器是低位码垛控制系统的控制中心。PLC自动循环扫描各个输入点的当前状态，并根据程序所确定的逻辑关系刷新输出点的状态，通过变频器、接触器和电磁阀来控制相应的电机的启停和气缸的动作，从而完成码垛工艺流程的自动控制；操作界面作为操作人员与设备之间的交互平台，接收来自操作人员的操作指令并指示设备的工作状态；检测元件检测料袋的有无、位置状态以及机械各部机和运动机构的动作状态；本系统所使用的控制元件有：变频器、接触器和电磁阀，接触器和电磁换阀的控制线圈与PLC输出点相连。当接触器控制线圈得电，则其常开触点接通，为电机供电，驱动电机运转；电磁阀得电来带动末端执行机构完成相应的动作。变频器通过改变输出频率控制电机转速。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入控制柜后，经接线端子变径后依次至负荷开关、总断路器。总负荷开关为表面安装形式，带有旋转手柄，在不打开控制柜门的情况下，可方便地通过旋转手柄完成总电源的通断。每个电机回路均有单独的电机保护断路器对其进行保护，从而保证了电机的安全运行，并且便于在发生故障的情况下查找故障点。系统所有的控制元件、检测元件的工作电源均为DC24V，保证了设备运行及人员操作的安全性。"}, "可编程控制器": {"text": "PLC 各通道输入输出点的使用情况如表2-1所示，输入输出模块中未接线的控制点均为备用。"}, "变频器": {"text": "系统中的转位机、推袋机、分层机、分层皮带机及升降机等电机由变频器驱动，以实现运转方向、速度的控制与调节。系统运行时，变频器通过逻辑输入端子接收PLC的逻辑输出信号，从而控制电机的正反转及转速。变频器的工作方式、预置速度、加减速时间等参数可通过变频器操作面板进行设置。详细操作方法、参数设定及故障处理对策等请参阅其说明手册。"}, "触摸式人机界面": {"text": "系统配有触摸式人机界面（简称触摸屏），具有形象、直观，操作简单，便于系统维修和维护等特点，集以往操作面板中的各种按钮、指示灯、计数器、时间继电器、以及各种示意图于一体。"}}, "工作原理及控制过程": {"text": "", "料袋输送": {"text": "本部分包括转位输送机之前的输送机，实现料袋输送、缓停、压平整形功能。控制过程为：转位输送机之前的输送机完成料袋的输送。压平机和压平输送机相互配合，完成料袋的压平整形。加速输送机用于拉大料袋间距，以便于转位机有足够的时间完成转位动作。在部机出口处设有检测开关，用于实现输送的逐级缓停功能。即当下级部机缓停时，如果本节部机再检测到料袋，本节部机随之缓停。检测开关也用于堵袋检测，当料袋堆积时，系统报警停车。"}, "转位编组控制": {"text": "本部分包括转位输送机、转位机和编组机，在码垛过程中完成转位和编组功能。", "转位": {"text": "转位部分包括输送机、转位旋转机构和转位夹持机构，依次由普通电机、变频电机、气缸驱动。转位的目的是为了满足编组的要求，实现料袋输送、转位功能。控制过程如下：料袋进入转位输送机，转位检测开关遮光后，根据编组要求，若需要转位，则输送机停止，夹板动作，将料袋夹持，转位电机驱动转位机构完成±90°或±180°转位，夹板松开料袋，料袋转位完成。料袋转位完成后，如果下级输送机满，则转位输送机不启动；否则将料袋输送给下级输送机。"}, "编组": {"text": "编组机用于实现料袋的编组功能。控制过程如下：如果进入编组机的料袋不是一组中的最后一袋，当料袋到达编组检测开关1时，编组机启动，直到料袋完全通过编组检测开关1时编组机停止；如果进入编组机的料袋是一组中的最后一袋，当料袋到达编组检测开关1时，编组机启动，直到该料袋完全通过编组光电开关2，且到达编组满光电开关位置时，编组机停止。"}}, "推袋控制": {"text": "推袋机用于实现将编组机上的料袋推至缓冲皮带(分层板)上，推袋机构由推袋小车和推袋板组成，分别由电机和气缸驱动。控制过程如下：码垛机由停止状态进入自动运行状态时，推袋小车应处于推袋后位，且推袋板为打开状态；若小车不在推袋后位，则推袋机自动完成停止前记忆的动作后，再返回推袋后位；当编组机中的料袋满一组，且满足推袋条件时，推袋板关闭。根据实际的工艺要求，推袋机将料袋推到前位。推袋小车高速向前推袋，经过推袋前位减速位时，推袋小车变为低速运行。到达推袋前位时，推袋小车停止，一层料袋被推到缓冲皮带(分层板)上。推袋至前位到位后，推袋板打开，推袋小车高速返回，经过推袋后位减速位时，推袋小车变为低速运行。到达推袋后位时，推袋小车停止。"}, "缓冲皮带、升降机、分层机、整形机构": {"text": "", "缓冲皮带": {"text": "缓冲皮带用于将整层料袋输送到分层机上。控制过程如下：当推袋机构推动料袋到达缓冲光电位置时，缓冲皮带启动。若推动的料袋为半层料袋，则半层料袋完全通过缓冲光电后，缓冲皮带停止运行；若推动的料袋为满层料袋，则缓冲光电被遮挡后，缓冲皮带一直运行，同时分层皮带启动，直到分层满光电有信号，缓冲皮带和分层皮带同时停止运行。"}, "升降机、分层机、整形机构": {"text": "分层机将分层板上的一层料袋放置在垛盘输送机的托盘（垛盘）上。升降机根据当前垛盘高度，带动分层机构上升或下降，配合分层机进行码垛动作。升降机的启停、运动速度和升降方向由PLC通过变频器进行控制。升降电机带有制动器，升降机运动时制动器通电释放，停止时制动器断电制动。控制过程如下：码垛机进入自动运行状态时，分层机初始处于取袋位置。当一层料袋推到分层机分层板上后，如果升降机在码垛位，升降机正向低速上升，当升降机离开码垛位光电位置，升降机停止；如果升降机在码垛减速位，则升降机正向高速上升，直到升降机离开码垛减速位，转为正向低速上升，当升降机离开码垛位光电位置，升降机停止。升降机上升停止后，分层机正向高速启动，到达分层送袋减速位，转变为正向低速向前，当到达分层送袋位时分层机停止。分层机启动送袋时，前整形阀得电，前整形装置动作整形。当分层到达送袋位时，中整形阀得电，中整形装置动作整形。中整形到位后，左、右整形阀得电，进行侧边整形。整形完成后，分层机反向高速启动（同时分层皮带启动运行），直到分层返回经过取袋减速位时，分层机变为反向低速运行；当分层到达取袋位后，分层机停止（同时分层皮带停止），前整形、中整形、左整形、右整形阀失电，整形机构复位。分层机回到分层取袋位后，升降机反向高速启动，直到升降机到达下降减速位时，升降机变为反向低速运行，当到达初始位时升降机停止。当码垛最后一层完成，开始排垛前，升降机在码垛位继续上升，到达升降机排垛位后停止，当垛盘离开排垛光电后，升降机下降返回到升降机初始位，进行下一码垛循环。"}}, "托盘仓、托盘输送": {"text": "", "托盘仓": {"text": "托盘仓主要用于空托盘存储和分拣。托盘底缸、托盘叉由气缸驱动。控制原理如下：托盘托架每升降一次，就将仓中最下面的托盘放置到托盘输送机上。自动运行状态下，如果托盘仓下的托盘输送机上无托盘且等待位检测光电无信号，即需要托盘仓释放托盘时，托盘底缸阀得电，托盘托架托住仓内托盘。当托盘托架升到上位，托盘叉阀得电，仓体两侧的四个托盘叉同步打开，延时后，托盘底缸阀失电，托盘托架下降，当托盘托架降至中位时，托盘叉气缸电磁阀失电，托盘叉收拢，插入托盘的叉孔中，保证托盘托架上仅剩一个托盘，并将其上的托盘支撑住。托盘托架继续下降到托盘输送机链条下方，将托盘放置在托盘输送机上；托盘仓中的托盘是由叉车放入的，按设计标准放置托盘数量。当托盘仓中的托盘数量少于3个时，声光报警器发出声光报警信号，报告托盘仓中托盘不足。当托盘叉上还有托盘时，可直接将成垛的空托盘放入托盘仓中；否则，放入空托盘前，需按托盘上升按钮，此时托盘底缸阀得电，托盘托架上升，当上升停止后，叉车可将托盘放入。"}, "托盘输送机": {"text": "托盘输送机用于输送空托盘。控制原理如下：当托盘传送位有托盘且托盘等待位无托盘时，托盘输送机启动，将托盘输送至等待位停止；当垛盘输送1位置需要空托盘时，托盘输送机将其上的托盘输送至垛盘输送机1上；如果在托盘输送过程中，按下了停止或急停按钮，当系统再次自动运行时，托盘输送机自动启动，将未到位的托盘输送到位。"}}, "托盘分拣、托盘输送": {"text": "起始时，托叉位于中后位。当托盘垛输送到位后，托叉伸缩电机运转（或托叉关闭阀得电），带动托叉向前伸出，插入倒数第二个托盘的叉孔中，将其上的托盘支撑住。托叉升降电机运转带动托叉升至上位停止。倒数第一个托盘由托盘输送机向前输送走后，托叉升降电机运转带动托叉下降至下位停止。托叉伸缩电机运转（或托叉打开阀得电）带动托叉向后缩回，将托盘垛重新放置在托盘输送机上。托叉升降电机运转带动托叉上升至中位，托叉伸缩电机运转（或托叉关闭阀得电），带动托叉向前伸出，再插入倒数第二个托盘的叉孔中。依次类推，直至将最后一个托盘放置在托盘输送机上。分拣后的托盘到达等待位，托盘输送机停止，如果在此过程中托盘尚未输送到位时按下了停止或急停按钮，则当系统再次自动运行时，托盘输送机自动启动，将托盘输送到输送位。如果码垛机码完一垛，垛盘排出时，托盘输送机随之启动，将等待位上的空托盘送到垛盘输送机1上，直到托盘到位后，托盘输送机才停止。"}, "托板仓、托板输送": {"text": "", "托板仓": {"text": "该部分控制取送托板装置（由托板输送电机驱动）、取/送托板气缸和真空系统，并检测托板仓是否空仓。托板输送电机为制动电机，取/送托板气缸由双控电磁阀控制，真空吸盘的真空通断由托板真空电磁阀控制。控制原理如下：取托板时，当取送托板装置位于取托板位置，取送托板气缸处于初始位置，真空开关为OFF，则取托板电磁阀接通，气缸杆伸出，真空电磁阀接通，当吸盘接触到托板时，将托板吸住，待真空开关检测真空度满足要求后，真空开关为ON，气缸杆缩回到初始位，托板输送电机启动，带动取送托板装置，将托板送到送托板位置。送托板电磁阀接通，气缸杆伸出，当放托板位置磁环开关为ON时，送托板电磁阀断电，气缸杆停止运动，真空阀断电，真空释放，反吹阀启动，托板放置在托盘输送机的托盘上，取托板回电磁阀接通，气缸杆缩回到初始位，托板输送电机反向启动，带动取送托板装置回到取托板位置，托板仓完成一个工作循环。"}, "托板输送": {"text": "托盘输送机用于输送空托板。控制原理如下：当托板传送位有托板且托板等待位无托板时，托盘输送机启动，将托板输送至等待位停止；当垛盘输送1位置需要空托板时，托盘输送机将其上的托板输送至垛盘输送机1上；如果在托板输送过程中，按下了停止或急停按钮，当系统再次自动运行时，托盘输送机自动启动，将未到位的托板输送到位。"}}, "垛盘输送机": {"text": "垛盘输送机用于空托盘的定位和垛盘的输送。垛盘输送机由电机驱动，托盘定位装置由气缸驱动。每个垛盘输送机上带有1个检测垛盘位置的检测开关。垛盘输送机1作为码垛位，用于空托盘的放置和码垛；其它垛盘输送机作为排垛下线位用于存放和输送满垛。控制原理如下：自动运行时，空托盘经由托盘输送机输送到垛盘输送机1上的码垛位。自动运行时，码垛机码完一垛后，垛盘输送机1上的托盘定位挡铁阀失电，挡板下降。如果满足排垛条件，输送机将垛盘输送至下一垛盘输送位；否则垛盘将在此垛盘输送机上等待，这时声光报警器发出报警信号，通知叉车及时将垛盘叉走。当垛盘离开垛盘输送机1后，托盘定位挡铁阀得电，挡板升起，将由托盘输送机输送过来的托盘定位。每节垛盘输送机都有逐级缓停功能。当垛盘到达缠膜机前一节垛盘输送机上，此节垛盘输送机停止。若收到缠膜机允许进入信号，则此节垛盘输送机启动将垛盘输送至缠膜机内。当垛盘缠膜完成后，若收到缠膜机请求出垛信号，且缠膜机后一节垛盘输送机有空位，则垛盘送出到缠膜机后一节垛盘输送机上。"}}, "操作界面": {"text": "操作界面包括操作盘及现场按钮盒。", "操作面板": {"text": "码垛机操作箱操作面板由触摸屏、钥匙开关、急停开关、带灯按钮和平头按钮、指示灯组成。", "按钮开关": {"text": ""}, "触摸屏界面": {"text": "主画面码垛机触摸屏通电后即进入主画面如图4-1所示，该画面共有九个按钮，分别用于切换到相应的画面。主画面自动操作画面在主画面点击”自动操作”按钮即进入自动操作画面，如图4-2所示。该画面包括多状态指示灯，计数显示，当前故障显示，运行指示灯，画面切换按钮等部分。自动操作画面多状态指示灯：用于提示操作者生产线当前所处的状态，包括：系统自动运行状态!存在报警未清除！操作错误！系统手动操作状态!紧急停车！系统停止状态!请进行转位初始化!PLC系统故障!……计数显示：码垛速度—显示码垛机运行速度；总垛数—记录码垛机当前所完成的垛数；当前层数—码垛机当前垛上所码的层数；编组计数—显示当前所完成的编组袋数；转位计数—显示当前所完成的转位袋数。指示灯：用于显示所对应部机当前的状态，当指示灯为亮绿色时，表示所对应的部机正在运行；当指示灯为暗绿色时，表示所对应的部机处于停止状态。主画面按钮：用于切换到相应画面。零袋处理按钮：在自动运行状态下，按下此按钮，可将编组输送机、过渡板、分层板上的料袋假定为一层，码到垛盘上，将垛盘排出，同时层数计数器、编组计数器、转位计数器清零，垛数加“1”。计数复位按钮：按下此按钮超过3秒钟，将清除“总垛数”计数。转位初始化按钮：在停止状态下，按下此按钮，伺服电机自动进行初始化操作，寻找初始位置。上游输送联锁按钮：选择系统是否向上游输出联锁信号。I/O监控画面在主画面点击“I/O监控”按钮，进入如图4-3所示。该画面列出了系统输入输出通道按钮。点击对应通道按钮就可以进入I/O点列表，查看I/O点当前状态。按下“输出测试”按钮可以进入输出点测试状态。按下“退出监控”按钮可以返回主画面。I/O监控画面初始设定画面在主画面点击“工作参数设置”按钮，弹出如图4-4所示，输入正确的用户名和密码，即可进入如图4-5所示。密码键盘画面初始设定画面手动操作画面当系统处于停止状态时，在主画面按“手动操作”按钮，进入手动操作主画面，如图4-6所示。在此画面中，可以手动操作各部机，也可以显示各个检测元件及执行元件的运行状态。手动操作画面T/C设置画面修改定时器设定值画面如图4-7所示，操作人员可以通过此画面修改PLC内部定时/计数器的设定值。修改参数部分由数值输入框组成，修改完成后，点击按钮即进入图4-8所示画面。可通过按钮上下翻页，点击返回主画面。定时器设置画面定时器/计数器操作画面故障查询画面故障查询画面如图4-9所示，该画面记录最近所发生的事件信息。历史事件画面在历史事件画面或当前事件画面内输入故障代码00，进入相应故障帮助画面如图4-10所示，或直接按“系统帮助“按钮进入帮助画面，再使用”搜索“进入相应故障的帮助画面。码垛机触摸屏提示的已定义的000障代码帮助画面如图4-10所示，其它故障信息查询与此相同。具体故障信息列表详见故障操作章节。故障代码001文档信息画面在主画面点击“文档信息”即进入如图4-11所示，点击相应按钮将弹出相应品牌故障代码及说明信息。文档信息画面屏功能参数配置画面屏功能参数配置画面如图4-12所示，需要操作者输入密码。功能参数配置画面"}}, "现场按钮盒 ": {"text": "", "平台立柱上按钮盒": {"text": "在垛盘1出口处的高平台立柱上设置了“急停”按钮盒，其按钮功能与操作箱操作面板上“急停”按钮作用相同。"}, "托盘仓处按钮盒": {"text": "在托盘仓叉车放置托盘侧设置了此按钮盒。其上按钮作用如下：“上升”按钮：当托盘等待位无托盘、托盘输送机停止运转时，按下此按钮，托盘托架升起。当托盘仓空仓，如果叉车放置托盘，必须按下此按钮，待托盘托架升起后，再放入空托盘。“下降”按钮：按下此按钮，托盘托架下降。"}, "托盘分拣机处按钮盒": {"text": "为了便于调试及放置空托盘，在托盘分拣机处设置了此按钮盒。其上按钮作用如下：“托叉 升降/伸缩”选择开关：手动运行状态下，用于选择托叉升降电机运行或托叉伸缩电机运行。“上升/伸出”按钮：“托叉 升降/伸缩”选择开关旋至升降时，按下该按钮，托叉升降电机运转，托叉升至中位或上位；“托叉 升降/伸缩”选择开关旋至伸缩时，按下该按钮，托叉伸缩电机运转，托叉伸出至前位。“下降/缩回”按钮：“托叉 升降/伸缩”选择开关旋至升降时，按下该按钮，托叉升降电机运转，托盘托架下降；“托叉 升降/伸缩”选择开关旋至伸缩时，按下该按钮，托叉伸缩电机运转，托叉缩回至后位。"}, "托板仓处按钮盒": {"text": "“手动取托板”按钮：当托板仓内有托板且取托板装置在取托板位。按下此按钮，取托板阀接通，气缸杆伸出，真空阀接通，将托板吸住，待真空压力满足要求后，气缸杆缩回到初始位。“手动弃托板”按钮：当取托板装置在取托板位，按下此按钮，真空释放，托板反吹阀启动，将托板释放。"}}}, "逻辑详述": {"text": "", "料袋输送": {"text": "料袋输送部分包括压平输送机、缓停输送机等部机。检测元件有：压平堵袋光电、加速输送光电。关于压平堵袋光电、整形输送光电、加速输送光电安装位置调整，应保证光电的检测方向与输送机输送方向垂直，光电检测高度以输送料袋中部为最佳。"}, "转位编组": {"text": "", "转位": {"text": "转位部分包括转位输送机、料袋转位机和转位夹板阀。检测元件有转位光电：位于转位输送机中部，转位定位接近开关。关于转位光电开关安装位置调整，应保证光电放置在输送机中间位置，且光电发射端和接收端与输送机有一定倾斜角度，光电检测高度以输送料袋中部为最佳。"}, "编组": {"text": "检测元件有编组光电开关1：位于转位机出口处，编组光电开关2：位于编组机入口处。关于编组光电开关1、编组光电开关2安装位置调整，首先需保证两个光电间距应小于一个料袋的宽度，若编组时料袋间的间距过大，可将编组光电开关1向编组机方向移动，反之向转位机方向移动，光电检测高度以输送料袋中部为最佳。"}}, "推袋": {"text": "推袋部分包括推袋电机和推袋推板阀。\t个别机型还包括前推板阀推袋机处共有6个接近开关，分别是推袋后位、推袋后位减速位、推袋前位减速位、推袋前位、推板开位和推板关位。"}, "分层机、升降机、整形机构": {"text": "", "分层": {"text": "分层机包括分层皮带电机和分层电机。在分层机下边缘同侧装有4个接近开关，分别是：分层取袋位、分层取袋减速位、分层送袋位、分层送袋减速位。"}, "升降": {"text": "升降机由垛1吊篮、升降配重和升降电机组成。升降机处检测元件包括：升降机初始位、升降机下降减速位、升降机排垛位。"}, "整形机构": {"text": "整形部分包括整形板和前、中、侧整形阀。检测元件有：左整形复位、右整形复位、前整形到位、前整形复位、中整形到位接近开关。"}}, "托盘仓、托盘输送": {"text": "", "托盘仓": {"text": "托盘仓由托盘仓本体、托盘底缸阀和托盘叉阀组成。在托盘仓底缸阀旁有托盘仓底缸上位、托盘仓底缸中位2个接近开关，在托盘仓侧面装有托盘仓托盘检测光电开。托盘底缸上位、托盘底缸中位配合托盘底缸阀和托盘叉阀，将托盘逐个放入托盘输送机上。根据托盘底缸阀完全顶起时托盘底缸检测片的位置，确认托盘底缸上位位置，然后根据托盘底缸阀和托盘叉阀气缸的动作，调整托盘底缸中位位置。"}, "托盘输送机": {"text": "由托盘输送机组成。在托盘输送机上有托盘传送位、托盘等待位2个光电开关。"}}, "托盘分拣、托盘输送": {"text": "", "托盘分拣": {"text": "由托叉升降电机和托叉伸缩电机组成；均为制动电机。设置的检测元件有：托叉升降上位、托叉升降中位、托叉升降下位、托叉伸缩前位、托叉伸缩前减速位、托叉伸缩后减速位、托叉伸缩后位接近开关。"}}, "托板仓、托板输送": {"text": "该部分控制取送托板装置（由托板输送电机驱动）、取/送托板气缸和真空系统，并检测托板仓是否空仓。托板输送电机为制动电机，取/送托板气缸由双控电磁阀控制，真空吸盘的真空通断由托板真空电磁阀控制。托板仓处设置的检测元件有：取板位置、送板位置接近开关，取托板回位、送托板到位磁环开关；真空系统设置了真空开关，用于检测管路内负压是否满足吸盘可靠吸住托板的要求；在托板仓底部设置一个光电开关，用于空仓检测。"}, "垛盘输送机": {"text": "垛盘输送机由垛盘输送机1和一组垛盘输送机组成，在垛盘输送机1上装有托盘定位挡铁阀。托盘定位挡铁气缸装有托盘定位挡铁下位，垛盘输送机1通过垛盘1光电开关定位托盘，垛盘输送机2及以后的每一节垛盘输送机均带有1个检测开关定位垛盘。托盘在垛盘输送机1的到位时间可由操作面板的触摸屏设定。垛盘输送机2以后的垛盘输送机数量需与操作面板设定参数一致。"}}, "故障处理": {"text": ""}}, "自动包装控制系统(单摆臂)": {"单元组成": {"text": "包装控制系统组成框图如图1-1所示。各组成部分的作用如下：PLC(可编程控制器)是包装控制系统的控制中心。PLC自动循环扫描各个输入点的当前状态，并根据程序所确定的逻辑关系刷新输出点的状态，通过变频器、接触器和电磁阀来控制相应的电机的启停和气缸的动作，从而完成系统工艺流程的自动控制；操作面板作为操作人员与设备之间的交互平台，接收来自操作人员的操作指令并指示设备的工作状态；检测元件检测料袋的有无、位置/位移状态以及机械各部机和运动机构的动作状态；系统所使用的控制元件有变频器、接触器和电磁换向阀。接触器和电磁换向阀的控制线圈与PLC输出点相连。当接触器控制线圈得电，则接触器的触点接通，为电机供电；电磁换向阀用于切换气缸缸杆的伸缩状态，从而带动相应的机构完成相应的动作。变频器通过改变输出频率控制电机转速，伺服驱动器可以实现对伺服电机的速度、位置、转矩的控制。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入控制柜后，经接线端子变径后依次至总负荷开关、总断路器。总负荷开关为表面安装形式，带有旋转手柄，在不打开控制柜门的情况下，可方便地通过旋转手柄完成总电源的通断。每个电机回路均有单独的电机保护断路器对其进行保护，从而保证了电机的安全运行，并且便于在发生故障的情况下查找故障点。系统所有的控制元件、检测元件的工作电源均为DC24V，保证了人员操作的安全性。"}, "可编程控制器": {"text": "PLC(可编程控制器)是控制系统的核心包装机控制系统采用的PLC包括16点／公共端的24V直流输入/输出通道4个；CPU自带14点24V直流输入、10点24V直流输出。PLC各通道输入输出点的使用情况如表2-1所示，表格中代号和名称栏空白为备用点。"}, " 变频器": {"text": "系统中的链排送袋等电机由变频器驱动，以实现运转方向、速度的控制与调节。系统运行时，变频器通过逻辑输入端子接收PLC的逻辑输出信号，从而控制电机的正反转及转速。变频器的工作方式、预置速度、加减速时间等参数可通过变频器操作面板进行设置。详细操作方法、参数设定及故障处理对策等请参阅其说明手册。各电机变频器参数设置参见《维护维修及故障处理》电气分册的《附录》部分。"}, "伺服驱动器": {"text": "伺服驱动器的I／O信号通过控制端子与PLC相连。伺服驱动器输出至PLC的信号：伺服准备好信号、伺服定位完成信号（伺服电机每一个位移结束时此信号输出为ON，允许进行下一次位置操作）、伺服故障信号。PLC输出至伺服驱动器的信号：①伺服允许；②伺服位置选择0；③伺服启动；④伺服参考点；⑤伺服位置选择1；⑥伺服使能。伺服驱动器的详细操作方法、参数设定及故障处理对策参阅其说明手册。"}, "触摸式人机界面": {"text": "系统配有触摸式人机界面（简称触摸屏），具有形象、直观，操作简单，便于系统维修和维护等特点，集以往操作面板中的各种按钮、指示灯、计数器、时间继电器、以及各种示意图于一体。"}}, "工作原理及控制过程": {"text": "包装机控制系统控制自动供袋、物料装袋、封袋口及料袋送出过程。", "供袋": {"text": "该部分控制送袋机构及储袋盘的升降机构。送袋机构由电机驱动。储袋盘升降机构由气缸驱动。供袋盘上可同时并排放置四组料袋。控制过程为：系统运行时，如果取袋位置有袋时，则取袋机构正常取袋；当料袋用尽，则储袋盘下降阀得电，升降机构带动托盘下降。下降到位后储袋盘与预存盘处于同一水平高度，供袋电机启动运行，将预存盘上的料袋输送至储袋盘。完成后，储袋盘上升阀得电，升降机构带动托盘返回。取袋机构正常取袋。"}, "取袋、链排送袋": {"text": "该部分控制的机构有取袋机构、压轮进袋机构。取袋机构和压轮由气缸驱动，取袋使用真空吸力。链排输送、进袋输送由电机驱动。控制过程：如链排不在回初始位至取袋安全区域，则取袋机构向下运动，取袋真空阀得电建立真空，当吸住包装袋后，取袋机构返回，取袋吹袋阀得电吹掉袋底粘连的料袋；当取袋机构返回至取袋回位后，链排高速启动；当链排运行到链排断真空位置时，取袋真空阀断电，取袋反吹阀动作，使料袋落在链排上，当链排运行到链排送袋减速位置时，链排变为低速运行至链排取袋完成位置。如果开袋位置无袋，且取袋机构再次取袋成功后，则链排再次高速启动送袋，同时进袋电机启动送袋，压轮压紧料袋，挡袋机构动作；到达进袋减速位后进袋电机转为低速运行，进袋到位后对中机构动作，压轮失电抬起，同时进袋电机送袋停止，对中机构延时一段时间后复位。如果系统处于重新上电状态，则需要对链排进行复位操作。根据触摸屏计数值，系统确定链排输送包装袋时，取袋阀得电时间点、取袋真空阀断电时间点、链排输送电机高速运行时段、链排输送电机低速运行时段。"}, "开袋撑袋、上袋、装袋": {"text": "该部分控制的机构有开袋机构、上袋机构、料门机构。开袋机构和料门机构均由气缸驱动，上袋机构由变频电机驱动，上袋机构上带有气缸驱动的抻袋机构；开袋吸盘使用真空吸力。控制过程为：当进袋到位且开袋机构处于上开袋上位时，开袋机构向下、向上运动，同时开袋真空阀得电，建立真空。当吸住包装袋时，上开袋机构退回到上开袋上位，包装袋口打开。角片插入袋口内，将袋口撑开。当角片进入袋内，则开袋真空阀失电，同时下开袋机构复位。上袋手爪抓住料袋，抻袋机构抻直袋口。若料门处无料袋，则上袋电机运行，上袋机构动作将袋口套入下料口处，随后发出允许投料信号；上袋臂到达上袋位后，料门夹板及料门手爪闭合，角片复位，上袋手爪打开，同时上袋臂返回至上袋臂取袋位。如果包装袋夹持良好，则料门机构打开，缩口机构动作收缩袋口配合料门机构开袋，将物料投入料袋；装袋完成后，缩口机构复位。若立袋输送机在中位，料门升降机构下降至下位，则拍袋阀动作拍袋，夹口阀动作夹住料袋口，料门爪手升降返回。"}, "夹口整形、封口、立袋输送": {"text": "该部分的控制包括前立袋输送机、排气夹口输送机、夹口输送机、折边机、后立袋输送机、缝口机，输送及缝纫动作由电机驱动；缝纫机的断线切刀由气缸驱动。控制过程如下：装袋完成后，前立袋输送机启动输送料袋，满袋被送至后立袋输送机上。经后立袋输送机输送进入排气夹口输送机、夹口整形机、封口机和缝口机。料袋进入封口机封内袋口。技术说明详见《封口机说明书》。普通缝口：当料袋依次进入缝纫机入口、出口光电检测区域时，缝纫机启动缝口；当料袋通过缝纫机出口光电后，缝纫机停止缝口，切刀切断缝纫线，完成一次料袋缝口过程。缝纫机线架上设置有断线检测机构，若判断断线故障，则系统停车报警。缝纫机线架上设置有断线检测机构，若判断断线故障，则系统停车报警。包纸带缝口：封完内膜的料袋在输送链条夹持下，通过切袋边装置，切刀将料袋口多余的部分切除，使袋口上边沿平整。当料袋遮住吹纸边光电时，吹纸边机构利用仪表风将切下的纸边吹走。夹持装置夹紧纸带，随着滚轮的转动，将纸带向前输送。在折纸带位置，折成∩形的纸带将料袋口覆盖。纸带输送装置将料袋口和纸带压紧一起向前输送。当包覆着纸带的料袋依次进入缝纫机入口、出口光电检测区域时，缝纫机启动缝口；当料袋通过缝纫机出口光电后，缝纫机停止缝口，切刀切断缝纫线及纸带，完成一次料袋缝口过程。缝纫机线架上设置有断线检测机构和断纸检测机构，若判断断线或断纸故障，则系统停车报警。"}, "倒袋输送": {"text": "倒袋输送由电机驱动，倒袋机构由气缸驱动。无动力倒袋：封完袋口的料袋经倒袋输送机自然放倒后向下游输送机输送。动力倒袋：封完袋口的料袋输送到倒袋输送机处的倒袋光电开关位置时，倒袋光电开关为ON，当ON再转为OFF时延时后，倒袋电磁阀得电，带动推袋板动作，将料袋推倒。延时后，倒袋电磁阀失电，带动推袋板复位。旋转倒袋：封完袋口的料袋输送到倒袋输送机处的倒袋光电开关位置时，倒袋夹袋阀动作，夹袋机构夹住料袋；倒袋转袋阀动作，转袋同时，倒袋取袋阀动作，将料袋由取袋位向前输送，将料袋放倒。"}}, "操作界面": {"text": "包装机操作界面包括操作箱操作面板及现场按钮盒。", "操作箱操作面板": {"text": "操作箱操作面板由触摸屏、钥匙开关、急停按钮和平头按钮组成。按钮指示灯功能如表4-1所示。", "触摸屏": {"text": "主画面包装机触摸屏通电后即进入主画面，如图4-1所示。该画面共有六个画面按钮，分别用于将系统切换到相应画面。主画面自动操作画面在主画面按“自动运行”按钮，或者启动条件满足的情况下，按动“启动”按钮，系统即进入自动运行状态并显示自动运行画面，如图4-2所示：自动操作画面画面最上方为长方形的多状态指示灯，用于提示操作者生产线当前所处的状态，如：“自动运行”、“停止状态！”等。长方框的右边显示系统时钟。多状态指示灯下方为计数显示部分，分别为总袋数、总吨数、当前袋数、当前速度的数值显示。在自动运行界面，有八个运行指示灯、八个按钮。取袋真空指示灯：用于指示取袋真空检测结果。当取袋真空达到设定值时，该指示灯为亮色，否则该指示灯为暗色。开袋真空指示灯：用于指示开袋真空检测结果。当开袋真空达到设定值时，该指示灯为亮色，否则该指示灯为暗色。夹袋检测指示灯：用于指示夹袋压力检测结果。当夹袋压力达到设定值时，该指示灯为亮色，否则该指示灯为暗色。料门闭合指示灯：用于指示料门处打开或关闭的状态。料仓无料指示灯：用于指示料仓内是否有物料。当有物料时，该指示灯为亮色，否则该指示灯为暗色。拍袋开位指示灯：用于检测拍袋装置位置，当处于拍袋开位时，该指示灯为亮色，否则该指示灯为暗色。夹口开位指示灯：用于检测夹口位置，当夹口装置处于开位时，该指示灯为亮色，否则该指示灯为暗色。角片光电指示灯：角片插入袋口时，该指示灯为亮色，否则该指示灯为暗色。，上袋伺服初始化按钮：按此按钮，上袋电机回到初始位置。上袋伺服使能按钮：用于给上袋伺服电机上电，当该按钮为深色时，上袋伺服可以启动运行。链排初始化按钮：用于使链排回到初始位置。计数清零按钮：用于清除计数部分所有显示。秤联锁按钮：用于接通或断开包装机与定量秤的联锁。选通颜色为蓝色，断开为灰色。当设备调试时可将其选为断开，便于设备的调试。默认初始状态为选通。码垛联锁按钮：用于接通或断开包装机与码垛机的联锁。选通颜色为蓝色，断开为灰色。当需要包装机单独运行时，可将其选为断开。默认初始状态为选通。主画面按钮：用于切换到主画面。允许投料按钮：按下该按钮，允许定量秤向包装机投料，否则不允许秤投料。手动操作界面手动操作界面如图4-3所示。在这几个界面中可以手动接通或断开电磁阀、电机等，可以方便的对取袋和开袋真空等进行测试，便于对真空开关的设定值进行设置。由于手动操作后，各个机构所处位置可能会对自动运行造成安全隐患，因此当系统处于自动运行时将不能进行测试，并请注意在退出手动操作界面前，须确认各个机构均处于正常位置！手动界面T/C设置T/C值设定界面如图4-4所示，操作人员可以通过此界面修改PLC内部与系统运行相关的部分的定时/计数器的设定值。画面中第一列上方为定时器号、下方为设置/显示框，用于设定及显示定时器的时间值；第二列是定时器名称及对定时器的进一步说明。T/C设置画面左端设有八个翻页按钮，点击按钮切换到相应定时器设置页面。点击，将弹出如图4-5所示画面，输入正确的用户名和密码后，即可进行T/C设置。“还原”、“初始化”及“备份”按钮，均需验证权限方可进行相关操作。TC值设定界面    输入密码界面I/O监控画面在主界面点击“I/O监控”按钮，弹出如图4-6所示界面。该画面列出了系统输入输出通道按钮。点击对应通道按钮就可以进入I/O点列表，查看I/O点当前状态。按下“进入测试”按钮可以进入输出点测试状态。按下“退出测试”按钮可以返回主画面。输入通道：通过对输入通道的监视，可以方便的检查各个输入信号的状态，对检测开关接线进行校对，以及对检测开关是否出现故障进行判断。例如输入通道1，如图4-7所示。其中Ix.x（x代表数字）为相应的输入地址，地址右侧与之对应的是该地址的输入状态指示灯及中文名称，指示灯为亮色表示相应的输入处于接通状态，反之则处于未接通状态。I/O通道选择画面输入通道输出通道：通过对输出点的强制，可以方便的检查各个执行机构的动作是否正确，对接线进行校对，以及对故障进行判断。例如输出通道1，如图4-8所示。其中Qx.x（x代表数字）为相应的输出地址，地址右侧与之对应的是该地址的控制按钮及中文名称，即当按下按钮时，按钮颜色变为亮色，相应输出点状态变为接通，其对应的执行机构应当动作，释放按钮后，颜色恢复暗色，对应的输出点恢复断开状态。 输出通道事件查询画面在主界面点击“事件查询”按钮，弹出故障历史界面，如图4-9所示。此界面记录当前发生的报警信息，包括报警内容、报警发生时间等。输入故障代码，进入相应故障的帮助界面。故障历史画面点击“返回”按钮，将切换到主画面；点击“帮助”按钮，将进入帮助画面，如图4-10所示。使用“代码搜索”进入相应故障的帮助画面。 故障代码001故障查询完成按“退出”进入主画面。系统配置画面在主界面点击“系统配置”按钮，弹出如图4-11所示界面。进行初始设置时，要求输入密码。系统参数设定界面"}}, "现场按钮盒": {"text": "", "缝纫机处按钮盒": {"text": "为了操作方便，在缝纫机处设有现场按钮盒其功能如表4-2所示："}, "前升降机处按钮盒": {"text": "“上升”按钮：按下按钮，前升降电机运转，升降机构升至“前升降上位”后，前升降电机停止。“下降”按钮：按下按钮，前升降电机反向运转，升降机构降至“前升降下位”后，前升降电机停止。"}, "后升降机处按钮盒": {"text": "“上升”按钮：按下按钮，后升降电机运转，升降机构升至“后升降上位”后，后升降电机停止。“下降”按钮：按下按钮，后升降电机反向运转，升降机构降至“后升降下位”后，后升降电机停止。"}}}, "逻辑详述": {"text": "", "供袋": {"text": "该部分包括供袋盘升降阀(A位/B位)，供袋电机。检测元件有储袋盘检测光电、袋补偿检测光电，储袋盘下位磁环开关。"}, "取袋、送袋": {"text": "该部分包括链排送袋电机，取袋阀、取袋真空阀、取袋反吹阀。检测元件有取袋回位磁环开关，链排初始位，进袋到位光电开关，取袋真空检测开关。 "}, "开袋撑袋、上袋、装袋": {"text": "该部分包括上袋电机，对中阀、开袋真空阀、上开袋阀、下开袋阀、上袋手爪阀、角片阀、上袋抻袋阀、料门夹板阀、夹袋压力阀、料门手爪阀、缩口阀、料门阀、料门手爪升降阀。检测元件有上开袋上位、上袋臂取袋位、上袋臂上袋位、上袋手爪合、角片进位、料门手爪合位、料门夹板合、料门关位，开袋真空检测开关，夹袋检测压力开关。"}, "夹口整形、缝口、立袋输送、倒袋输送": {"text": "该部分包括前立袋输送电机、排气夹口输送电机、夹口输送电机、折边电机、后立袋输送电机、缝纫电机、夹口阀、切线阀、吹纸边阀、取袋阀、转袋阀、夹袋阀。检测元件有缝纫机入口、缝纫机出口、倒袋检测光电开关，缝针断线检测、钩针断线检测接近开关。"}}, "故障处理": {"text": ""}}, "封口机": {"单元组成": {"text": "封口机控制系统组成框图如图1-1所示。本控制系统以可编程控制器为中心，通过接收检测元件（接近开关、光电开关）的信号，控制料袋口夹持、吹尘、切边及包边热封后的切断纸带操作，并在操作面板上提示缺少纸带、纸带断裂等故障。接触器、加热器、热电偶及温控器组成加热控制部分。由可编程控制器控制前、后加热器的通断电，使加热器加热。热电偶检测加热器的温度，反馈给温控器，温控器根据热电偶检测的温度值，以PID方式控制加热器的加热时间、温度等参数（温控器有显示），并将加热信号、报警信号（温度不在设定范围）等反馈给可编程控制器，以保证加热元件表面恒温，或由可编程控制器控制将报警信号发送到操作界面，提示人工处理。可编程控制器将热封控制系统的正常运行信号传递给包装机控制系统，并接收包装机运行信号，以实现与包装机的联锁运行关系。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入控制柜后，经接线端子变径后至断路器。操作现场所有控制元件、检测元件及主令电器的工作电源均为24VDC，因而提高了1人员操作的安全性。"}, "可编程控制器": {"text": "封口机控制系统采用的PLC输入通道地址为00CH～01CH，输出通道地址为100CH～101CH。PLC 各通道输入输出点的使用情况如表2-1所示，表格中代号和名称栏空白为备用点。"}, "温度控制器": {"text": "本控制系统采用的温度控制器，温度控制范围可在100~180℃，目标温度可通过面板按钮方便地进行设定，并具有报警输出等功能。"}}, "工作原理及控制过程": {"text": "封口机控制系统现场元件布置如图3-1所示；现场元件明细如表3-1所示。封口机控制系统包括料袋口吹尘机构、纸带夹送机构、吹纸边及断纸带机构。设置的检测元件有纸带检测、吹尘位置、吹纸边位置、夹纸带位置、切纸带位置等光电开关，并设有断纸检测接近开关，用于检测是否发生断纸。控制过程为：缝口完毕的料袋在立袋输送机的输送下进入封口机，当料袋遮住吹尘光电时，吹尘机构利用仪表风将料袋袋口两侧附带的粉尘清除；当料袋口经过切边装置时，切刀将料袋口多余的部分切除，使袋口上边沿平整。当料袋遮住吹纸边光电时，吹纸边机构利用仪表风将切下的纸边吹走；热熔胶带盘储存于封口机体上，前端由折纸器折成∩形后，前送至进纸带压轮处待用。当料袋到达夹纸带位置时，纸带夹送机构动作，压轮夹紧热熔胶带，随着料袋口的前进同步进给，使热熔胶带完全包覆袋口。当料袋完全通过切纸带光电开关后，断纸带机构动作，将热熔胶带切断。同时，纸带夹送机构复位，热熔胶带停止进给。包覆着热熔胶带的料袋通过加热组件时，热熔胶熔化产生粘附力，经封口机出口压轮的压紧并冷却，使胶带与料袋口完全粘附，实现密封；如果发生断纸或缺纸故障时，断纸检测接近开关保持通或断超时，或缺纸检测光电开关漏光，操作界面给出报警信号；加热组件的温度由温控器进行控制。控制原理见温控器说明书。"}, "操作界面": {"text": "封口机操作界面包括控制柜及操作盘。", "控制柜": {"text": "控制柜位于封口机侧面。控制柜内元件布置参阅电气图册。"}, "封口机操作盘": {"text": "封口机操作盘位于封口机架上，布置如图4-1所示；操作盘元件功能如表4-1所示。包括报警蜂鸣器、故障指示、状态指示以及操作控制开关等几个部分。下面分别予以说明。"}}, "逻辑详述": {"text": "该部分包括吹尘阀、吹纸边阀、夹纸带阀、切纸带阀。检测元件有纸带检测光电、吹尘光电、吹纸边光电、夹纸带光电、切纸带光电，断纸检测开关。"}, "故障处理": {"text": ""}}, "套膜机": {"单元组成": {"text": "拉伸套膜控制系统组成框图如图1-1所示。控制系统以可编程控制器PLC CPU为核心，通过CPU一体化数字量I/O模块及扩展数字量I/O模块、PROFIBUS总线连接的分布式I/O连接检测、控制元件以及操作盘；并通过总线连接支持PROFIBUS总线通讯的热封控制器。各组成部分的作用如下：操作界面作为操作人员与设备之间的交互平台，接收来自操作人员的操作指令并指示设备的工作状态；检测元件检测垛盘的有无、位置/位移状态以及机械各机构的动作状态；PLC自动循环扫描各个输入输出点的当前状态，并根据程序所确定的逻辑关系刷新输出点的状态，通过变频器、接触器和电磁阀来控制相应电机的启停和气缸的动作，从而完成套膜工艺流程的自动控制；本系统所使用的控制元件有变频器、接触器和电磁换向阀。接触器和电磁换向阀的控制线圈与PLC输出点相连。当接触器控制线圈得电，则接触器的常开触点接通，为电机供电；电磁换向阀用于切换气缸缸杆的伸缩状态，从而带动相应的机构动作，完成相应的动作；变频器通过改变输出频率控制电机转速。PLC根据操作盘界面设定的加热温度，控制热封控制器的输出，以保证膜的热封效果。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入控制柜后，经接线端子变径后至总负荷开关和小型断路器。系统的每个电机均有单独的电机保护断路器对其进行保护，从而保证了电机的安全运行，并且便于在发生故障的情况下查找故障点。操作现场上所有的控制元件、检测元件及按钮开关的工作电源均为DC24V，提高了设备运行及人员操作的安全性。详细的供电原理参阅随机电气图册。"}, "可编程控制器": {"text": "PLC 各通道输入输出点的使用情况如表2-1、2-2所示，表格中项目代号和名称栏空白为备用点。"}, "变频器": {"text": "控制系统采用十二个变频器，分别用于套垛输送电机、右横向拉膜电机、左横向拉膜电机、右纵向拉膜电机、左纵向拉膜电机、进膜电机、夹手摆臂电机、升降电机、右前卷膜电机、右后卷膜电机、左后卷膜电机、左前卷膜机的速度控制。变频器的工作方式、加减速时间等参数可通过其面板键盘设置。变频器的控制端子LI1和LI2分别控制电机的正转和反转。变频器的详细操作方法、参数设定及故障处理对策参阅其说明手册。"}, "触摸屏": {"text": "系统操作界面上配有触摸屏。该产品带有10″LCD显示屏，具有操作简单，显示直观的特点，可直接触动屏幕进行操作。在本套生产线的实际应用中，为人机界面设置了生产线运行状态显示、I/O监控、手动操作、设备自动运行指示及故障报警和报警帮助等多个画面，并应用了操作人员等级密码设定等功能，具体应用详见后续触摸屏界面说明部分内容。"}, "热封控制器": {"text": "膜热封控制采用ROPEX公司RES-406热封控制器，用于膜底的加热控制。该控制器具有控制加热速度快、热封效果好等特点，同时具有加热线路的故障自诊断功能，故障代码在触摸式人机界面上显示。RES-406热封控制器通过PROFIBUS总线控制，可以使用总线控制热封控制器的功能和查询热封控制器的信息。PLC通过PROFIBUS总线对热封控制器的目标温度进行设定并且读取当前的温度值，从而实现热封系统目标温度设置和当前温度监视，以上信息均显示在触摸式人机界面上，方便于用户监控。在本包装系统中，热封控制器与PLC相连的信号包括：①自校准信号AUTOCAL（AC），当热封系统更换加热片或者加热线路故障修复后，需通过此信号进行校准，校准时需要设定校准温度，该温度大致接近环境温度即可（可在触摸屏中设定）；②加热启动信号START（ST），用于启动热封控制器进行加热；③复位信号RESET（RS），用于线路及加热片以外的故障复位；④测量暂停信号Measurement pause（MP），用于正常模式下没有故障触发时，加热管的所有电信号需要被断开连接，该信号触发后，停止测量所有电信号，实际信号不再更新，与RS相比，该信号不复位任何故障信息；⑤故障报警信号ALARM，当热封控制器本身或者加热片或者加热线路发生故障时，热封控制器发出此信号；⑥故障代码存储器，用于存储热封控制器故障代码。热封控制器的详细技术资料请参见其使用说明书。"}}, "工作原理及控制过程": {"text": "", "覆膜": {"text": "上游输送来的垛盘输送至覆膜输送机上。覆膜到位检测开关由OFF转为ON后，覆膜输送电机停止运行，覆膜机进行覆膜。覆膜完成后，覆膜输送机继续启动运行，将覆膜的垛盘输送到套垛输送机上。"}, "整形": {"text": "若整形输送机上空闲无垛盘，则进垛输送机和整形输送机运行，将垛盘输送到整形输送机上。当整形输送位置检测开关由OFF转为ON后，整形输送电机停止运行。整形输送电机停止后，垛盘右定位阀和左定位阀得电，带动定位板至定位位置将垛盘定位。定位完成后，定位板返回至定位回位，整形输送机启动将垛盘输送至套垛输送机上。"}, "翻垛": {"text": "使用翻垛机时：当垛盘到达正入垛口检测位置时，垛盘输送链排启动，链排到达套垛位有垛检测光电位时，链排停止运行，等待套膜。套膜完成后，链排启动运行，当正接垛位接近开关检测到垛盘时，经延时，链排停止运行，垛盘被送出套膜机。垛盘进入翻垛机翻垛，翻垛完成后，排垛输送机反向运行，垛盘再次送入套膜机套垛。套垛完成后将垛盘输送下线。翻垛机工作原理参见《翻垛机控制系统用户手册》。"}, "供膜、开袋、卷膜、拉伸套膜控制": {"text": "套膜机启动运行后，进膜电机工作，带动膜卷转动，直到薄膜端部运动至成型开袋机构中的两对吸盘之间，当达到所需长度时，电机停止工作；当升降机构位于升降机接膜位时，吸盘阀得电，向中间运动合拢，当吸盘阀到达关位时真空阀得电，开膜真空检测开关为ON，建立真空，吸住薄膜；进膜电机少量进膜后，吸盘阀失电，将薄膜拉开至吸盘开位，开膜夹手阀得电，夹住膜的侧边（此时如果开膜检测真空为OFF，则真空建立失败，系统报警开膜失败），同时真空阀失电。进膜电机第三次进膜，当达到设置长度时，再次停止，夹手摆臂机构电机运转，摆臂向下运动到下限位置。摆臂到达下限位置后，如果有新的垛盘到达套垛位置，则拉膜装置平移机构向内合拢，至接膜位置后停止，升降机向上运动到上限位；收膜轮压紧，夹手阀失电，薄膜落到拉膜弧板上；收膜轮压紧，进膜电机和卷膜电机同时运转将薄膜收入拉膜弧板底部后收膜轮打开；拉膜装置平移机构再次打开到预设位置二，收膜轮再压紧，进膜电机和卷膜电机同时运转，当进膜至制袋长度时，进膜和卷膜电机停止，热封夹持阀得电，将薄膜夹住，热封组件阀得电，热封组件到达关位，切刀开始切膜，切断薄膜后，温控器开始按设定温度加热，加热时间到，热封阀失电打开，同时冷却阀得电，使薄膜封口处速度冷却。冷却时间到，热封夹持阀失电打开，卷膜电机运转收膜至设定长度。膜袋被收入四个拉膜弧板处，横纵向机构将薄膜拉伸到预设位置三后，升降机构下降，并根据位置设定值自动套垛，且卷膜电机同时放膜，（如果垛型不规整或垛盘定位整形不准确，导致套垛过程中横向或纵向轮廓检测被触发，设备将中断套垛，自动进行修正尺寸后，再继续套垛），当升降机构到达升降下限位时，升降机构停止，收膜滚轮打开回到初始位置，膜袋脱离；套膜动作完成后，横、纵向机构向四角运动到全开极限位置，整个拉伸升降机构重新向上运动，返回至初始位置。"}, "排垛输送机": {"text": "套膜动作完成后，排垛输送1电机启动运行，将垛盘输送至排垛输送机1上。如果满足排垛条件，则输送机将垛盘输送至下一排垛输送位；否则垛盘将在此排垛输送机上等待。每节垛盘输送机都有逐级缓停功能。"}}, "操作界面": {"text": "拉伸套膜机操作界面包括控制柜上操作盘及现场按钮盒。", "控制柜": {"text": "控制柜操作面板由触摸屏、钥匙开关、急停按钮和平头按钮组成。按钮指示灯功能如表4-1所示。"}, "触摸屏": {"text": "主界面套膜机触摸屏通电后即进入系统主界面如图4-2所示，该画面共有7个按钮，分别用于将系统切换到相应的操作或监视界面。系统主界面系统自动运行界面在主画面点击”自动操作”按钮即进入系统自动运行界面，如图4-3所示。该画面包括多状态显示灯，显示计数部分，当前故障显示，运行指示灯，画面切换按钮等部分。系统自动运行操作界面多状态指示灯：用于提示操作者生产线当前所处的状态，包括：套垛自动运行状态!存在报警未清除！手动操作状态!紧急停车!停止状态！暂停状态！输送自动运行状态！计数显示：显示当前计数值。指示灯：用于显示所对应机构当前的状态，当指示灯为浅色时，表示所对应的部机正在运行；当指示灯为深色时，表示所对应的部机处于停止状态。按钮：用于功换画面或使运动机构完成相应动作。手动操作界面当系统处于“紧急停车”、“停止状态”状态时，在主界面按“手动操作”按钮，系统进入画面如图4-4~4-11所示的手动操作界面。手动操作界面用于机构动作测试、处理故障后观察机构动作是否正常、维修后调试检查等。按动按钮，状态指示灯显示应相应改变。各脉冲显示值显示接近开关测量的实时脉冲值，操作者可参考其进行参数设置。手动操作界面0手动操作界面1手动操作界面2手动操作界面3手动操作界面4手动操作界面5手动操作界面6手动操作界面7系统参数选择画面在主界面按“系统参数”按钮，弹出如图4-11所示界面，输入正确的用户名及密码后，再按主界面“系统参数”按钮即可进入系统参数配置界面，如图4-12。登陆界面系统参数配置界面TC设置界面在系统主画面点击 “TC设置”按钮，弹出如图4-13所示界面，输入正确的用户名及密码后，再按主界面“TC设置”按钮即可进入各个相应的参数配置界面。如图4-14~4-19所示。时间参数配置1界面卷膜参数配置界面升降参数配置界面进膜参数配置界面横纵向参数配置界面温控器参数配置界面时间参数配置2界面系统事件查询界面在系统主画面点击 “历史事件”按钮，将进入此画面，提示故障信息和故障所发生的时间及当前的操作记录，如图4-20~4-23所示。历史事件查询界面当前事件查询及故障分析界面变频器故障分析界面温控器故障分析界面IO监测在主画面点击“IO监测”按钮，即可进入图4-24所示画面。监控选择界面在图4-24所示画面中，点击相应按钮，即可进入相应的画面，如图4-25~4-28。输入点监控1界面输入点监控2界面输出点监控1界面输出点监控2界面"}, "现场按钮盒": {"text": "有三个操作按钮盒位于拉伸套膜工作现场，其中二个位于安全门处的“急停”按钮开关，另一个位于膜卷支架支腿上。急停按钮与操作箱上“急停按钮”功能相同。", "膜卷支架支腿上的按钮盒": {"text": "“加热”按钮：按下按钮，温控器开始按设定温度加热。“热封夹紧”按钮：按下按钮，热封夹持阀得电，夹持机构将薄膜夹住。“膜卷升降”选择开关：用于更换膜卷。切换膜卷升降开关位置，使翻转托架上升或下降至适当高度，将穿轴后的膜卷置入翻转托架上，调整膜卷左右对称后，再使用膜卷升降开关，使翻转托架上升，膜卷离地适当高度后，将开关切换至中位。"}}}, "逻辑详述": {"text": "", "卷膜支架": {"text": "该部分包括膜卷热封阀。检测元件有膜卷热封开位磁环开关、薄膜用尽光电。"}, "调偏机构": {"text": "该部分包括左调整阀、右调整阀。检测元件有左调整回位磁环开关、左调整去位磁环开关、右整回位磁环开关、右调整去位磁环开关，左膜卷边检测光电、右膜卷边检测光电。"}, "进膜机构": {"text": "该部分包括进膜电机、真空泵电机，热封夹持阀、切刀动作阀、热封阀、吸盘阀、真空阀、冷却阀。检测元件有吸盘开位1、吸盘关位1、吸盘开位2、吸盘关位2、热封1开位、热封1关位、热封II开位、热封II关位、热封开位、热封关位、切刀右位、切刀左位磁感式接近开关，左吸盘真空检测开关、右吸盘真空检测开关。"}, "支撑平台": {"text": "该部分包括升降电机、夹手摆臂电机，夹手阀。检测元件有开膜摆臂上位、开膜摆臂下位、升降机左上限位、升降机左下限位、安全销检测1、安全销检测2、升降机右上限位、升降机右下限位、安全销检测3、安全销检测4电感式接近开关，右前开膜夹手开位、右后开膜夹手开位、左后开膜夹手开位、左前开膜夹手开位磁感式接近开关，系统压力开关。"}, "拉膜装置": {"text": "该部分包括右横向拉膜电机、左横向拉膜电机、右纵向拉膜电机、左纵向拉膜电机、右前卷膜电机、右后卷膜电机、左后卷膜电机、左前卷膜电机，右收膜轮阀A、左收膜轮阀B。检测元件有右前纵向轮廓、右前横向轮廓、右前纵向轮廓、右后横向轮廓、左后纵向轮廓、左后横向轮廓、左前纵向轮廓、左前横向轮廓、右纵向内限位、右纵向外限位、左纵向内限位、左纵向外限位、右横向内限位、右横向外限位、左横向内限位、左横向外限位，右前收膜轮开位、右后收膜轮开位、左后收膜轮开位、左前收膜轮开位磁感式接近开关。"}, "输送单元": {"text": "该部分包括覆膜输送电机、套垛输送电机、排垛输送1电机、垛盘右定位阀、垛盘左定位阀、垛盘支架阀。检测元件有垛盘后支架回位、垛盘后支架到位、垛盘右定位、垛盘左定位、垛盘前支架前位、垛盘前支架到位、垛盘右回位、垛盘左回位磁感式接近开关，覆膜到位检测、套膜等待位检测、套垛定位检测光电开关，垛高检测超声波传感器。"}}, "故障处理及维护检修": {"text": ""}}, "机器人码垛机": {"系统概述": {"text": "", "码垛机工艺流程": {"text": "机器人码垛机控制系统协调和控制料袋输送机、机器人、托盘/垛盘输送机等各部机的动作，使各设备按照设定的工艺流程来完成整个生产过程。系统工艺流程如图1-1所示。合格料袋经整形、缓停输送机进入取袋位置，在取袋输送机上整形后等待码垛机器人抓取码垛。码垛机器人在抓取码垛的过程中同时自动进行编组计数，按实际工作要求，将料袋码放到托盘。码完设定的层数后，由垛盘输送机将垛盘排出到下线位，由叉车叉走入库。当系统自动运行时，叉车需将成垛的空托盘放入托盘仓中，托盘仓（或托盘分拣机构）能自动地将最下面一个托盘放置到托盘输送机上，再由托盘输送机输送到垛盘输送机上的码垛位置，供机器人码垛使用。"}, "系统组成": {"text": "机器人码垛控制系统组成框图如图1-2所示。各组成部分的作用如下：可编程控制器是码垛控制系统的控制中心。PLC自动循环扫描各个输入输出点的当前状态，并根据程序所确定的逻辑关系刷新输出点的状态，通过接触器和电磁阀来控制相应的电机的启停和气缸的动作；机器人控制模块通过计算机单元扫描内部总线状态，结合内部运动程序和逻辑判断程序，通过驱动模块来控制机器人的各个伺服电机，带动机械结构完成码垛机器人的各个动作；机器人控制模块通过总线与可编程控制器PLC进行通讯，从而完成整个码垛流程的自动控制；操作面板和手持操作器作为操作人员与设备之间的交互平台，接收来自操作人员的操作指令并指示设备的工作状态；检测元件（光电开关、接近开关等）检测料袋/垛盘的有无、位置/位移状态以及机械各部机和运动机构的动作状态；控制元件（接触器、电磁换向阀等）的控制线圈与PLC输出点相连。接触器用于控制电动机的启停，其控制线圈得电时常开触点接通，为电机供电，驱动电机运转；电磁换向阀用于切换气缸缸杆的伸缩状态，从而带动相应的机构完成相应的动作。"}}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入控制柜后，经接线端子变径后依次至负荷开关、总断路器。总负荷开关为表面安装形式，带有旋转手柄，在不打开控制柜门的情况下，可方便地通过旋转手柄完成总电源的通断。每个电机回路均有单独的电机保护断路器对其进行保护，从而保证了电机的安全运行，并且便于在发生故障的情况下查找故障点。系统所有的控制元件、检测元件的工作电源均为DC24V，保证了设备运行及人员操作的安全性。"}, "可编程控制器": {"text": "本系统的PLC配置包括16点／公共端的24V直流输入/输出模块2个，CPU自带14点24V直流输入、10点24V直流输出、PROFIBUS通讯口一个。输入点用于接收现场传感器开关、操作盘按钮开关以及码垛机器人控制输出的信号等。输出点用于控制操作盘指示灯，电磁阀（气缸），输送电机和报警装置的控制以及输出给码垛机器人控制器的信号。"}, "触摸式人机界面": {"text": "系统配有触摸式人机画面（简称触摸屏），具有形象、直观，操作简单，便于系统维修和维护等特点，集以往操作面板中的各种按钮、指示灯、计数器、时间继电器、以及各种示意图于一体。"}}, "工作原理及控制过程": {"text": "", "倒袋输送": {"text": "动力倒袋：当料袋输送到倒袋光电开关位置时，倒袋光电开关为ON，当ON再转为OFF延时后，倒袋阀得电，带动推袋板动作，将料袋推倒。延时后，倒袋阀失电，带动推袋板复位。无动力倒袋：料袋在倒袋输送机上自然放倒。"}, "辊子输送、整形输送、缓停输送": {"text": "料袋经辊子输送机进入整形压平机压平整形，使包装袋内的物料均衡分布，以利于机器人码垛。在辊子输送机的出口处有一个检测开关，用于控制辊子输送机的动作，即当整形输送机处有一组物料并且缓停输送机上也有物料时，如果下一个料袋已到达辊子输送机出口的检测开关处，则辊子输送机停止输送。在整形输送机的出口处有一个检测开关，用于控制整形输送机的动作，即当取袋输送机处有一组物料并且缓停输送机上也有物料时，如果下一个料袋已到达整形输送机出口的检测开关处，则整形输送机停止输送。在码垛过程中，当料袋密集时，缓停输送机使料袋输送暂停，以便在取袋输送机上的料袋有足够的时间被码垛机器人取走。在缓停输送机靠近取袋输送机侧装有一个检测开关，用于控制缓停输送机的动作。如果取袋输送机上有料袋，此时缓停输送机上再有料袋，则缓停输送机停止运行，以防止料袋堆积在取袋输送机上，造成码垛机器人无法抓取码垛。"}, "取袋输送": {"text": "料袋停放在取袋输送机处由码垛机器人进行抓取码垛。取袋输送机末端有一个光电开关，用于控制取袋输送机的动作。当料袋抓取位光电开关常ON（此位有料袋）时，取袋输送机停止运行；当料袋抓取位光电开关常OFF（无料袋）,而此时缓停光电常OFF时，取袋输送机保持停止状态，直到缓停光电ON时取袋输送机启动，将料袋输送至抓取位后停止运行。"}, "码垛机器人": {"text": "码垛机器人是整个码垛机系统的核心部分。本系统采用的ABB机器人能够通过轴的联合运动来完成手臂水平前后运动，垂直升降运动，本体回转运动以及手腕的旋转运动，并依靠自身特有的机械结构保持手爪的垂直姿态。机器人本身设有软限位，对机器人所能达到的空间位置进行限定，起到保护的作用。在机器人手腕部分有两个电磁阀，实现在抓取位置的取袋控制和卸垛位置的卸垛控制。机器人抓取料袋后，结合其内部运动程序和逻辑判断程序，对料袋卸垛位置和运动路径进行自动编组规划，将料袋运至既定位置卸下料袋，同时进行料袋计数。如果取袋输送机上手爪抓取位置没有料袋，则手爪在抓取位置往码垛位置上方一定距离一直等待。"}, "托盘仓、托盘输送": {"text": "", "托盘仓": {"text": "托盘仓主要用于空托盘存储和分拣。托盘底缸、托盘叉由气缸驱动。控制原理如下：托盘托架每升降一次，就将仓中最下面的托盘放置到托盘输送机上。自动运行状态下，如果托盘仓下的托盘输送机上无托盘且等待位检测光电无信号，即需要托盘仓释放托盘时，托盘底缸阀得电，托盘托架托住仓内托盘。当托盘托架升到上位，托盘叉阀得电，仓体两侧的四个托盘叉同步打开，延时后，托盘底缸阀失电，托盘托架下降，当托盘托架降至中位时，托盘叉气缸电磁阀失电，托盘叉收拢，插入托盘的叉孔中，保证托盘托架上仅剩一个托盘，并将其上的托盘支撑住。托盘托架继续下降到托盘输送机链条下方，将托盘放置在托盘输送机上；托盘仓中的托盘是由叉车放入的，按设计标准放置托盘数量。当托盘仓中的托盘数量少于3个时，声光报警器发出声光报警信号，报告托盘仓中托盘不足。当托盘叉上还有托盘时，可直接将成垛的空托盘放入托盘仓中；否则，放入空托盘前，需按托盘上升按钮，此时托盘底缸阀得电，托盘托架上升，当上升停止后，叉车可将托盘放入。"}, "托盘输送": {"text": "托盘输送机用于输送空托盘。控制原理如下：如果系统配备托盘等待位，则当托盘传送位有托盘且托盘等待位无托盘时，托盘输送机启动，将托盘输送至等待位停止；当垛盘输送1位置需要空托盘时，托盘输送机将其上的托盘输送至垛盘输送机1上；如果在托盘输送过程中，按下了停止或急停按钮，当系统再次自动运行时，托盘输送机自动启动，将未到位的托盘输送到位。"}}, "托盘分拣、托盘输送": {"text": "起始时，托叉位于中后位。当托盘垛输送到位后，托叉伸缩电机运转（或托叉关闭阀得电），带动托叉向前伸出，插入倒数第二个托盘的叉孔中，将其上的托盘支撑住。托叉升降电机运转带动托叉升至上位停止。倒数第一个托盘由托盘输送机向前输送走后，托叉升降电机运转带动托叉下降至下位停止。托叉伸缩电机运转（或托叉打开阀得电）带动托叉向后缩回，将托盘垛重新放置在托盘输送机上。托叉升降电机运转带动托叉上升至中位，托叉伸缩电机运转（或托叉关闭阀得电），带动托叉向前伸出，再插入倒数第二个托盘的叉孔中。依次类推，直至将最后一个托盘放置在托盘输送机上。分拣后的托盘到达等待位，托盘输送机停止，如果在此过程中托盘尚未输送到位时按下了停止或急停按钮，则当系统再次自动运行时，托盘输送机自动启动，将托盘输送到输送位。如果码垛机码完一垛，垛盘排出时，托盘输送机随之启动，将等待位上的空托盘送到垛盘输送机1上，直到托盘到位后，托盘输送机才停止。"}, "托板仓、托板输送": {"text": "", "托板仓": {"text": "该部分控制取送托板装置（由托板输送电机驱动）、取/送托板气缸和真空系统，并检测托板仓是否空仓。托板输送电机为制动电机，取/送托板气缸由双控电磁阀控制，真空吸盘的真空通断由托板真空电磁阀控制。控制原理如下：取托板时，当取送托板装置位于取托板位置，取送托板气缸处于初始位置，真空开关为OFF，则取托板电磁阀接通，气缸杆伸出，真空电磁阀接通，当吸盘接触到托板时，将托板吸住，待真空开关检测真空度满足要求后，真空开关为ON，气缸杆缩回到初始位，托板输送电机启动，带动取送托板装置，将托板送到送托板位置。送托板电磁阀接通，气缸杆伸出，当放托板位置磁环开关为ON时，送托板电磁阀断电，气缸杆停止运动，真空阀断电，真空释放，反吹阀启动，托板放置在托盘输送机的托盘上，取托板回电磁阀接通，气缸杆缩回到初始位，托板输送电机反向启动，带动取送托板装置回到取托板位置，托板仓完成一个工作循环。"}, "托板输送": {"text": "托盘输送机用于输送空托板。控制原理如下：当托板传送位有托板且托板等待位无托板时，托盘输送机启动，将托板输送至等待位停止；当垛盘输送1位置需要空托板时，托盘输送机将其上的托板输送至垛盘输送机1上；如果在托板输送过程中，按下了停止或急停按钮，当系统再次自动运行时，托盘输送机自动启动，将未到位的托板输送到位。"}}, "垛盘输送": {"text": "垛盘输送机用于空托盘的定位和垛盘的输送。垛盘输送机由电机驱动，托盘定位装置由气缸驱动。每个垛盘输送机上带有1个检测垛盘位置的检测开关。垛盘输送机1作为码垛位，用于空托盘的放置和码垛；其它垛盘输送机作为排垛下线位用于存放和输送满垛。控制原理如下：自动运行时，空托盘经由托盘输送机输送到垛盘输送机1上的码垛位。自动运行时，机器人码完一垛后，垛盘输送机1上的托盘定位挡铁阀失电，挡板下降。如果满足排垛条件，输送机将垛盘输送至下一垛盘输送位；否则垛盘将在此垛盘输送机上等待，这时声光报警器发出报警信号，通知叉车及时将垛盘叉走。当垛盘离开垛盘输送机1后，托盘定位挡铁阀得电，挡板升起，将由托盘输送机输送过来的托盘定位。每节垛盘输送机都有逐级缓停功能。当垛盘到达缠膜机前一节垛盘输送机上，此节垛盘输送机停止。若收到缠膜机允许进入信号，则此节垛盘输送机启动将垛盘输送至缠膜机内。当垛盘缠膜完成后，若收到缠膜机请求出垛信号，且缠膜机后一节垛盘输送机有空位，则垛盘送出到缠膜机后一节垛盘输送机上。"}}, "操作界面": {"text": "操作界面包括操作盘及现场按钮盒。", "码垛机操作盘": {"text": "码垛机操作盘设置在控制柜门上，由触摸屏、钥匙开关、急停开关、带灯按钮，平头按钮等组成。", "按钮开关和指示灯": {"text": ""}, "触摸屏界面": {"text": "系统运行主画面码垛机触摸屏通电后即进入主画面如图4-1所示，该画面共有10个按钮，分别用于切换到相应的画面。主画面自动运行界面回零完成后，在主画面点击”自动操作”按钮或按下控制柜操作面板上的“启动”按钮，触摸屏将进入自动操作画面，如图4-2所示。该画面包括多状态指示灯、显示计数部分、当前故障显示、机器人运行指示灯、画面切换按钮等部分。多状态指示灯：用于提示操作者生产线当前所处的状态，包括：存在报警未清除系统停止状态系统自动运行状态系统手动操作状态紧急停车机器人手动模式机器人程序未运行……计数显示：当前层数——当前垛盘上（箱子里）已有的整层层数；当前袋数——当前垛盘上（箱子里）已有的料袋袋数； 当前速度——机器人运行速度百分比，点击可更改；当前工作数组——机器人当前正在使用的垛型数组；总垛数——码垛机当前所完成的垛（箱）数。指示灯：用于显示机器人当前工作状态，包括工作模式、伺服使能、程序运行、故障指示。当指示灯为亮绿色时，表示所对应的信号为ON；当指示灯为暗绿色时，表示所对应的信号为OFF。主画面、机器人操作、故障历史按钮：用于切换到相应画面。强制排垛按钮：在自动运行状态下，按下此按钮，可以把当前垛盘（箱子）强制排出，垛数加“1”，层数、袋数清零；在非自动运行情况下“强制排垛”按钮不起作用。参数修正按钮：在系统停止状态下，按下此按钮，可以对机器人运行参数进行修改。自动操作画面手动运行界面当系统处于停止状态时，在主画面按下“手动操作”按钮，进入如图4-3所示的画面。在此画面中，可以手动操作各部机动作，也可以显示各个检测元件及执行元件的运行状态。点击“主画面”按钮可以切换到主画面，点击“自动操作”按钮可以切换到自动运行界面。 手动运行画面 回零界面每次系统重新上电后自动运行前，机器人都需要执行回零动作，使手爪回到预先设定的安全位置。重新上电后，在主画面点击”自动操作”按钮或按下控制柜操作面板上的“启动”按钮，触摸屏将进入“回零”画面，如图4-4所示。按下“回零”按钮后，触摸屏提示操作者：系统正在回零，请耐心等待。除“急停”按钮外，请不要进行其他操作。如果不需进行“回零”操作，可以按下 “”退出该界面。 回零画面如果回零没有完成而意外终止或按下了“急停”按钮，触摸屏会显示未完成回零操作的提示，仍然要求回零操作，如图4-5所示，如果不需回零而进行其它操作，可以按下“”按钮退出该画面，否则可以在确认机器人运动范围内安全并且机器人未提示错误的情况下按下“回零”按钮。回零提示画面 I/O点查询与测试界面在主画面点击“I/O操作”按钮，进入如图4-6所示画面。该画面列出了可编程控制器PLC的输入输出模块，点击模块就可以进入相应的I/O点列表，查看I/O点当前状态。按下“进入测试”按钮可以进入输出点测试状态，测试完毕后应按下“退出测试”按钮，否则程序无法正常运行。按下“退出监控”按钮可以返回主画面。\nI/O操作画面 工作参数设定界面在主画面中点击“工作参数设定”按钮，进入如图4-7所示画面，需要输入操作员密码。在该画面可以设定机器人码垛机的初始运行参数，包括每垛最大层数、每层最大袋数、当前工作数组、当前工作模式、共有垛盘节数等。可通过上下翻页按钮进入垛型参数查询界面。 工作参数设定画面T/C设置界面在主画面点击“T/C设置”按钮，进入如图4-8所示画面，本操作需要输入操作员密码。在该画面可以设定PLC内部定时/计数器的设定值。T/C设置画面 工作参数查询界面在主画面点击“工作参数查询”按钮，进入如图4-9所示画面。该画面显示机器人码垛机的工作参数和垛型参数。 工作参数查询画面参数备份与恢复界面在工作参数设定画面中点击“备份恢复”按钮，进入如图4-10所示画面，本操作需要输入操作员密码。按压“数据备份”按钮超过4秒钟直到显示“命令已执行”即完成数据备份操作；按压“数据恢复”按钮超过4秒钟直到显示“命令已执行”即完成数据恢复操作。  参数备份与恢复画面统计数据查询在主画面点击“统计数据查询”按钮进入如图4-11所示画面，本操作需要输入操作员密码。该画面是机器人码垛机工作参数的记录，包括码垛运行总垛数、码垛运行总时间、码垛当前速度以及每小时产量统计。 统计数据查询界面历史故障画面在主画面中点击“故障历史”，进入如图4-12所示画面，该画面记录最近所发生的报警信息。故障历史画面当前故障界面在主画面中点击“当前故障”，进入如图4-13所示画面，该画面记录当前所发生的报警信息。当前故障画面在故障历史或当前故障画面的输入框内输入故障代码，进入相应故障帮助画面，或直接按“故障分析”按钮，进入帮助画面进行查询。码垛机触摸屏提示的已定义的000故障帮助画面如图4-14，其它故障信息查询与此相同。具体故障信息列表详见故障操作章节。故障代码000功能参数配置界面功能参数配置界面如图4-15所示，需要操作者输入密码，包括用户管理、用户登录等管理。 功能参数配置界面"}}, "现场按钮盒": {"text": "", "托盘仓处按钮盒": {"text": "在托盘仓叉车放置托盘侧设置了此按钮盒。其上按钮作用如下：“上升”按钮：当托盘等待位无托盘、托盘输送机停止运转时，按下此按钮，托盘托架升起。当托盘仓空仓，如果叉车放置托盘，必须按下此按钮，待托盘托架升起后，再放入空托盘。“下降”按钮：按下此按钮，托盘托架下降。"}, "托盘分拣机处按钮盒": {"text": "为了便于调试及放置空托盘，在托盘分拣机处设置了此按钮盒。其上按钮作用如下：“托叉 升降/伸缩”选择开关：手动运行状态下，用于选择托叉升降电机运行或托叉伸缩电机运行。“上升/伸出”按钮：“托叉 升降/伸缩”选择开关旋至升降时，按下该按钮，托叉升降电机运转，托叉升至中位或上位；“托叉 升降/伸缩”选择开关旋至伸缩时，按下该按钮，托叉伸缩电机运转，托叉伸出至前位。“下降/缩回”按钮：“托叉 升降/伸缩”选择开关旋至升降时，按下该按钮，托叉升降电机运转，托盘托架下降；“托叉 升降/伸缩”选择开关旋至伸缩时，按下该按钮，托叉伸缩电机运转，托叉缩回至后位。"}, "安全护栏上停止按钮盒": {"text": "在码垛机安全护栏1、2处各设置有1个“急停”按钮盒，其按钮功能与控制柜操作面板上的“急停”按钮相同。"}, "托板仓处按钮盒": {"text": "“手动取托板”按钮：当托板仓内有托板且取托板装置在取托板位。按下此按钮，取托板阀接通，气缸杆伸出，真空阀接通，将托板吸住，待真空压力满足要求后，气缸杆缩回到初始位。“手动弃托板”按钮：当取托板装置在取托板位，按下此按钮，真空释放，托板反吹阀启动，将托板释放。"}}}, "机器人操作": {"text": "", "机器人控制柜操作面板": {"text": "机器人控制柜操作面板如图5-1所示。操作面板  模式开关位置如图5-2所示。"}, "机器人手持操作器简介": {"text": "", "ABB菜单": {"text": "ABB菜单"}, "滚屏和缩放": {"text": "一个屏幕不一定能显示所要查看的全部内容。要查看全部内容，您可以：• 向上／向下滚动（有时是向左／向右）• 放大或缩小（仅在程序编辑器中可用）  滚屏和缩放"}, "状态栏": {"text": "状态栏会显示当前状态的相关信息，例如操作模式、系统、活动机械单元。如图5-5所示。状态栏图示"}, "按钮功能": {"text": "按钮功能"}, "“快速设置 ”菜单": {"text": "点击手持操作器右下角的图标，“快速设置”菜单弹出，点击机械单元图标A、点击“显示细节”，进入画面如图5-7所示。  其中：D 手动操作速度控制B 坐标系统设置：即系统手动操作时运动所在的坐标系。分为大地坐标、基坐标、工具坐标和工件坐标。坐标系统设置C 动作模式设置：动作模式设置"}}, "机器人手持操作器示教": {"text": "按下停止按钮停止机器人码垛机控制系统；把机器人控制柜前面板上的钥匙开关旋至手动操作模式(即图5-2的D)，在“ABB”菜单中，点击“程序编辑器”；如图5-11所示，点击“调试”，点击“PP 移至例行程序”；  如图5-12所示，选择“shijiao”例行程序，点击“确定”；点击“SetDO Teaching_manual, 1;”一行使其变蓝，然后依次点击“调试”，“PP 移至光标”，把程序指针即左边的小箭头指向该行，然后左手持示教器，四指握住示教器使能开关（在示教器下方黑色胶皮里面），点击“步进”按钮，如图5-13所示，单步执行程序，首先向码垛机控制柜发送一个正在示教的信息，避免有人在示教期间操作码垛机触摸屏，引起不必要的伤害；按向下滚动翻页双箭头，翻到“Take out need Teaching manual dot data”提示行，点击其下面一行Take_point_dat使其变蓝，依次点击“调试”，“PP 移至光标”， 如图5-14 ；然后左手持示教器，四指握住手持操作器使能开关（在示教器下方黑色胶皮里面），按下连续执行按钮，按照提示（如下图所示）选择选项，对 码垛机器人，需要选择“0——…”，然后点击“确定”即可，如图5-15；然后需要选择的第二个选项（如图5-16所示）是1～4其中的一项（如果需要更多选项可以选择―――More options），选择其中的一个需要示教的数据块，点击“确定”即可，程序执行完毕，程序状态指示由“正在运行”变为“已停止”。程序执行完毕，松开左手四指握住的示教器使能开关，点击操作员窗口，可以回到第d步的界面。根据提示“Return Teaching manual program top process Teaching manual”，按向上滚动翻页双箭头返回示教例行程序顶部，开始对需要示教的点进行示教。示教方法：首先把光标移动到需要示教的点上(例如p_take)，点击该点使其变蓝，然后把机器人手动移动到需要的位置，点击“修改位置”。此操作需要操作者确认是否真的要修改，并且修改以后不可撤销，如果真的要修改则点击“确定”，否则点击“取消”即可，重复该过程，直到把所有的点位置示教完毕。示教例行程序中p_take_on为抓取点上方一点，p_take为抓取点，p_safety_J为码垛路径中的安全位置，Target_Temp{1,1}为第一层第一袋卸垛点，Target_Temp{1,2}为第一层第二袋卸垛点，依次类推，Target_Temp{1,5}为第一层第五袋卸垛点。Target_Temp{2,1}为第二层第一袋卸垛点，Target_Temp{2,2}为第二层第二袋卸垛点，依次类推，Target_Temp{2,5}为第二层第五袋卸垛点。第一次示教必须对每一个点都要示教一次，以后可以针对影响垛型的单个点进行示教；单个点位置修改完毕后，根据提示“Save Teaching manual dot data”（如图5-19所示），保存示教点数据，点击其下Save_point_dat一行使其变蓝，依次点击“调试”，“PP 移至光标”，然后重复第f步；保存数据完毕，此时光标指向Reset Teaching_manual一行，点击该行使其变蓝，依次点击“调试”，“PP 移至光标”，然后左手持示教器，四指握住示教器使能开关（在示教器下方黑色胶皮里面），点击“步进”按钮，向码垛机控制柜发送一个示教结束的信号。把机器人控制柜前面板上的钥匙开关旋至自动运行模式位置，在手持操作器上依次点击“确认”、“确定”。然后可以参照码垛机开车程序启动码垛机。刚刚示教完毕第一次运行时，一定要把触摸屏和手持式操作器上的速度都设到最低，然后再启动码垛机，在机器人运行时一手持手持操作器，一手放在手持操作器急停按钮上，以备在机器人发生意外碰撞时及时按下急停按钮。在码垛机低速运行码完一垛确定没有发生意外碰撞且码垛效果良好的情况下，再把速度提高到正常速度即可，如果发生碰撞或码垛效果不好，存在示教点数据不正确，需重新示教。"}}, "逻辑详述": {"text": "", "料袋输送": {"text": "料袋输送部分包括倒袋输送机、辊子输送机、整形输送机、缓停输送机、取袋输送机。检测元件有：辊子输送光电位于辊子输送机出口处，整形输送光电位于整形输送机出口处，缓停输送光电位于缓停输送机出口处，抓取位置光电位于抓取位置光电末端。"}, "托盘仓、托盘输送": {"text": "", "托盘仓": {"text": "本部分由托盘仓本体、托盘底缸阀、托盘叉阀、托盘输送机组成。在托盘仓底缸阀旁有托盘仓底缸上位、托盘仓底缸中位两个接近开关，在托盘仓侧面装有托盘不足检测检测开关。托盘底缸上位、托盘底缸中位配合托盘底缸阀和托盘叉阀，将托盘逐个放入托盘输送机上。根据托盘底缸阀完全顶起时托盘底缸检测片的位置，确认托盘底缸上位位置，然后根据托盘底缸阀和托盘叉阀气缸的动作，调整托盘底缸中位位置。"}, "托盘输送": {"text": "本部分由托盘输送机组成。在托盘输送机上有托盘传送位、托盘等待位两个检测开关，当设备没有托盘等待位检测开关时，在接线盒处端子上将两个信号短接。"}}, "托盘分拣、托盘输送": {"text": "", "托盘分拣": {"text": "由托叉升降电机和托叉伸缩电机组成；均为制动电机。设置的检测元件有：托叉升降上位、托叉升降中位、托叉升降下位、托叉伸缩前位、托叉伸缩前减速位、托叉伸缩后减速位、托叉伸缩后位接近开关。"}}, "托板仓、托板输送": {"text": "该部分控制取送托板装置（由托板输送电机驱动）、取/送托板气缸和真空系统，并检测托板仓是否空仓。托板输送电机为制动电机，取/送托板气缸由双控电磁阀控制，真空吸盘的真空通断由托板真空电磁阀控制。托板仓处设置的检测元件有：取板位置、送板位置接近开关，取托板回位、送托板到位磁环开关；真空系统设置了真空开关，用于检测管路内负压是否满足吸盘可靠吸住托板的要求；在托板仓底部设置一个光电开关，用于空仓检测。"}, "垛盘输送": {"text": "垛盘输送机由垛盘输送机1和一组垛盘输送机组成，在垛盘输送机1上装有托盘定位挡铁阀。托盘定位挡铁气缸装有托盘挡铁下位，垛盘输送机1上设有垛盘输送1位置，垛盘输送机2上设有垛盘输送2位置，垛盘输送机3设有1个垛盘输送检测开关。托盘在垛盘输送机1的到位时间可由操作面板的触摸屏设定，系统共有垛盘数量需与操作面板的触摸屏设定参数一致。"}, "机器人码垛": {"text": "机器人控制模块通过总线与可编程控制器PLC进行通讯，和机器人动作相关的主要信号IO有取袋信号、托盘准备好信号、码垛完成信号、排垛信号等。"}}, "": {"text": ""}, "故障处理": {"text": ""}, "附录": {"text": "", "校准机器人零点位置的具体方法": {"text": "第一步:选择手动操纵   （如图8-1，需将把钥匙开关打到手动位置）方法:  1> 点击 ABB       2> 点击 手动操纵第二步:选择动作模式   （如图8-2、8-3）方法:  1> 点击 动作模式       2> 点击 轴1 － 3   或者  轴4 － 6       3> 点击 确定第三步:选择工具坐标   （如图8-2、8-4）方法:  1> 点击 工具坐标       2> 点击 tGripper       3> 点击 确定手动操纵动作模式第四步:选择移动速度   （如图8-2、8-5）方法:  1> 点击 增量2> 点击 中  或者  小       3> 点击 确定工具增量第五步:手动移动机器人各轴到机械零点位置   （如图8-2）方法:  此时图8-2上 操纵杆方向 处显示操纵杆移动方向于轴的对应关系如果先前选择 轴1 － 3 则1> 操纵杆上下移动为2轴动作2> 操纵杆左右移动为1轴动作3> 操纵杆顺/逆时针旋转为3轴动作如果先前选择 轴4 － 6 则1> 操纵杆上下移动为5轴动作2> 操纵杆左右移动为4轴动作3> 操纵杆顺/逆时针旋转为6轴动作  1> 左手持示教器，四指握住示教器使能开关（在示教器下方黑色胶皮里面）2> 右手向唯一一个方向轻轻移动操纵杆，把各轴按顺序移动到各自机械绝对零点a) 六轴机器人零点位置b) 四轴机器人零点位置机器人零点位置移动顺序，依次为6轴→5轴→4轴→3轴→2轴→1轴，否则会使4，5，6轴升高以致于看不到零点位置。机械零点位置如图8-6所示，当所有六个轴全部对准机械零点位置以后，机器人的姿态正如图中所示。第六步:更新转数计数器   （如图8-1，此时可以释放示教器使能开关）方法:  1> 点击 ABB       2> 点击 校准3> 点击 ROB_1    （如图8-7）校准       4> 点击 转数计数器    （如图8-8）       5> 点击 更新转数计数器…    （会弹出一个警告界面）       6> 点击 是更新转数计数器       7> 点选 显示转数计数器未更新 所有轴，显示转数计数器已更新的轴不用选择    （如图8-9）       8> 点击 更新    （会弹出一个警告界面  如图8-10）转数计数器       9> 点击 更新    （会弹出一个进度窗口  然后等待）提示       最后显示更新以后的状态如图8-11所示       10> 点击 关闭    （更新完毕）更新完毕第七步:重新启动机器人方法:  1> 点击 ABB2> 点击 重新启动3> 点击 热启动", "": {"text": ""}}, "FlexPendant的操作方式": {"text": "1、 操作 FlexPendant 时，通常左手持设备，右手在触摸屏上操作。具体手持方法如图8-12所示手持方法2、手持操作器主要部件  如图8-13所示手持操作器3、控制柜上的主要按钮和端口  如图8-14所示控制柜面板4、控制柜上钥匙开关的位置意义  如图8-15所示钥匙开关"}}}, "高位码垛机": {"单元组成": {"text": "码垛控制系统组成框图如图1-1所示。各组成部分的作用如下：可编程控制器是码垛控制系统的控制中心。PLC自动循环扫描各个输入点的当前状态，并根据程序所确定的逻辑关系刷新输出点的状态，通过变频器、接触器和电磁阀来控制相应的电机的启停和气缸的动作，从而完成码垛工艺流程的自动控制；操作画面作为操作人员与设备之间的交互平台，接收来自操作人员的操作指令并指示设备的工作状态；检测元件检测料袋的有无、位置状态以及机械各部机和运动机构的动作状态；本系统所使用的控制元件有：变频器、伺服驱动器、接触器和电磁阀，接触器和电磁阀的控制线圈与PLC输出点相连。当接触器控制线圈得电，则其常开触点接通，为电机供电，驱动电机运转；电磁阀得电来带动末端执行机构完成相应的动作。变频器通过改变输出频率控制电机转速，伺服驱动器可以实现对伺服电机的速度、位置、转矩的控制。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入控制柜后，经接线端子变径后依次至负荷开关、总断路器。总负荷开关为表面安装形式，带有旋转手柄，在不打开控制柜门的情况下，可方便地通过旋转手柄完成总电源的通断。每个电机回路均有单独的电机保护断路器对其进行保护，从而保证了电机的安全运行，并且便于在发生故障的情况下查找故障点。系统所有的控制元件、检测元件的工作电源均为DC24V，保证了设备运行及人员操作的安全性。"}, "可编程控制器": {"text": "本系统的PLC配置包括16点／公共端的24V直流输入/输出模块3个，CPU自带14点24V直流输入、10点24V直流输出。PLC各通道输入输出点的使用情况如表2-1所示，输入输出模块中未接线的控制点均为备用。"}, "变频器": {"text": "系统中的推袋机、分层机及升降机等电机由变频器驱动，以实现运转方向、速度的控制与调节。系统运行时，变频器通过逻辑输入端子接收PLC的逻辑输出信号，从而控制电机的正反转及转速。变频器的工作方式、预置速度、加减速时间等参数可通过变频器操作面板进行设置。详细操作方法、参数设定及故障处理对策等请参阅其说明手册。"}, "伺服驱动器": {"text": "码垛机控制系统采用1台伺服驱动器，用于控制转位伺服电机完成±90°或±180°的料袋转位。伺服驱动器的I／O信号通过控制端子与PLC相连。伺服驱动器输出至PLC的信号：伺服驱动器准备好信号、伺服定位完成信号（伺服电机每一个位移结束时此信号输出为ON，允许进行下一次位置操作）、伺服故障信号。PLC输出至伺服驱动器的信号：①伺服位置选择0；②伺服位置选择1；③伺服位置启动；④伺服零位；⑤伺服位置选择2；⑥伺服使能。伺服驱动器的详细操作方法、参数设定及故障处理对策参阅其说明手册。"}, "触摸式人机界面": {"text": "系统配有10″的触摸式人机界面（简称触摸屏），具有形象、直观，操作简单，便于系统维修和维护等特点，集以往操作面板中的各种按钮、指示灯、计数器、时间继电器、以及各种示意图于一体。"}}, "工作原理及控制过程": {"text": "码垛机现场元件布置如图3-1、元件明细如表3-1所示。", "料袋输送": {"text": "本部分包括整形压平机及之前的输送机、加速输送机，实现料袋输送、缓停、压平整形功能。控制过程为：整形压平机之前的输送机完成料袋的输送。压平机和整形输送机相互配合，完成料袋的压平整形。加速输送机用于拉大料袋间距，以便于转位机有足够的时间完成转位动作。在部分部机出口处设有光电开关，用于实现输送的逐级缓停功能。即当下级部机缓停时，如果本节部机光电检测到料袋，本节部机随之缓停。光电开关也用于堵袋检测，当料袋堆积时，系统报警停车。"}, "转位编组控制": {"text": "本部分包括转位输送机、转位机、编组缓停机（根据实际设备配置）和编组机，在码垛过程中完成转位和编组功能。", "转位": {"text": "转位部分包括输送机、转位旋转机构和转位夹持机构，依次由普通电机、伺服电机、气缸驱动。转位的目的是为了满足编组的要求，实现料袋输送、转位功能。控制过程如下：料袋进入转位输送机，转位光电开关遮光后，根据编组要求，若需要转位，则输送机停止，夹板动作，将料袋夹持，转位伺服电机驱动转位机构完成±90°或±180°转位，夹板松开料袋，料袋转位完成。料袋转位完成后，如果下级输送机满，则转位输送机不启动；否则将料袋输送给下级输送机。"}, "缓停": {"text": "当料袋输送至编组缓停光电开关处时，PLC根据编组机上的编组信号决定是否启动转位输送机输送料袋。如果编组机满，则输送机不启动，否则输送机启动，将料袋输送给编组机。"}, "编组": {"text": "编组机用于实现料袋的编组功能。控制过程如下：如果进入编组机的料袋不是一组中的最后一袋，当料袋到达编组光电开关1时，编组机启动，直到料袋完全通过编组光电开关1时编组机停止；如果进入编组机的料袋是一组中的最后一袋，当料袋到达编组光电开关1时，编组机启动，直到该料袋完全通过编组光电开关2时编组机停止。在现场调试时，根据实际物料，编组电机的速度可通过编组变频器调整为最佳速度。"}}, "推袋控制": {"text": "推袋机用于实现将编组机上的料袋推至中间过渡位置或直接推至分层板上，推袋机构由推袋小车和推袋板组成，分别由电机和气缸驱动。控制过程如下：码垛机由停止状态进入自动运行状态时，推袋小车应处于推袋后位，且推袋板为打开状态；若小车不在推袋后位，则推袋机自动完成停止前记忆的动作后，再返回推袋后位；当编组机中的料袋满一组，且满足推袋条件时，推袋板关闭。根据实际的工艺要求，推袋机分别将料袋推到中位或前位。若推到中位，推袋小车高速向前推袋，经过推袋中位减速位时，推袋小车变为低速运行。到达推袋中位时，推袋小车停止，半层料袋被推到中位（过渡板上）。若推到前位，推袋小车高速向前推袋，经过推袋前位减速位时，推袋小车变为低速运行。到达推袋前位时，推袋小车停止，一层料袋被推到分层板上。推袋至中位或前位到位后，推袋板打开，推袋小车高速返回，经过推袋后位减速位时，推袋小车变为低速运行。到达推袋后位时，推袋小车停止。"}, "侧边整形、分层、压袋控制": {"text": "侧边整形和压袋保证料袋之间比较紧凑，垛形外观整齐；分层机将分层板上的整层料袋放置在升降机托架的托盘上。分层机由电机驱动；侧边整形机构、压拍由气缸驱动。", "侧边整形": {"text": "码垛机由停止状态进入自动运行状态时，分层机的侧边整形板为缩回状态。当推袋小车将整层的料袋推到分层板上，且推袋板打开后，侧边整形阀得电，侧边整形板伸出并保持，将整层料袋整理紧凑。当压袋完成后返回时，侧边整形板缩回。"}, "分层、压袋": {"text": "控制过程如下：码垛机由停止状态进入自动运行状态时，分层板处于关闭位置。当推袋机将整层料袋推上分层板后，侧整形完成且升降机在上升临界位置，分层机正向高速启动，分层板向两侧打开。经分层机开减速位置时，分层机变为低速运行，同时压拍开始动作，对料袋进行压平；分层板到达分层开位时分层机停止运动；料袋落在升降托架的托盘上。升降机下降后，离开上升临界位时，分层机反向高速启动，分层板向中间关闭。当分层板到达分层机关减速位置时，分层机变为低速运行；分层板到达分层关位时分层机停止运动，完成一个动作循环；压拍动作一定时间后，压拍复位。升降机开始下降，到达预定位置时，分层板闭合。"}}, "升降机控制": {"text": "升降机用于空托盘/垛盘升降，配合分层机进行码垛动作。升降电机带有制动器，升降机运动时制动器通电释放，停止时制动器断电制动。控制过程为：由托盘仓输送来的空托盘到达垛盘输送机1光电位置，升降机高速上升，当到达上升减速位时，转为低速上升，升降机到达上位时，升降机停止。当分层板打开，完成压袋动作后，升降机开始高速下降，当离开上升临界光电后，升降机转为低速，运行一定时间后停止；待分层板关闭后，升降机低速上升，直到其中一个上升临界光电开关遮光一定时间后，升降机停止，为码下一层料袋做准备；在分层板打开、升降机高速下降过程中，如果计数判断已码完设定的层数，升降机持续高速下降，当下降至升降下降减速位，升降机转为低速下降，升降机到达下位时，升降机停止；若此时满足排垛条件，将垛盘排出，进入下一码垛循环。"}, "托盘仓、托盘输送、垛盘输送": {"text": "", "托盘仓": {"text": "托盘仓主要用于存储空托盘。托盘底缸、托盘叉由气缸驱动。控制原理如下：托盘仓中的托盘是由叉车放入的，按设计标准放置托盘数量。当托盘仓中的托盘数量少于3个时，声光报警器发出声光报警信号，报告托盘仓中托盘不足。当托盘叉上还有托盘时，可直接将成垛的空托盘放入托盘仓中；否则，放入空托盘前，需按托盘上升按钮，此时托盘底缸阀得电，托盘托架上升，当上升停止后，叉车可将托盘放入；托盘托架每升降一次，就将仓中最下面的托盘放置到托盘输送机上。自动运行状态下，如果托盘仓下的托盘输送机上无托盘，即需要托盘仓释放托盘时，托盘底缸阀得电，当托盘托架升到上位，托盘叉阀得电，仓体两侧的四个托盘叉同步打开，托盘托架托住仓内托盘。延时后，托盘底缸阀失电，托盘托架下降，当托盘托架降至中位时，托盘叉气缸电磁阀失电，托盘叉收拢，插入托盘的叉孔中，保证托盘托架上仅剩一个托盘，并将其上的托盘支撑住。托盘托架继续下降到初始位置，并把托盘放置在托盘输送机上。"}, "托盘输送机": {"text": "托盘输送机用于输送空托盘。控制原理如下：当托盘传送位有托盘且托盘等待位无托盘时，托盘输送机启动，将托盘输送至等待位停止；当垛盘输送1位置需要空托盘时，托盘输送机将其上的托盘输送至垛盘输送机1上；如果在托盘输送过程中，按下了停止或急停按钮，当系统再次自动运行时，托盘输送机自动启动，将未到位的托盘输送到位。"}, "垛盘输送机": {"text": "垛盘输送机用于空托盘的定位和垛盘的输送。垛盘输送机由电机驱动，托盘定位装置由气缸驱动。每个垛盘输送机上带有一个检测垛盘位置的检测开关。控制原理如下：自动运行时，当码垛机码完一垛，升降机下降过程中，垛盘输送机上的托盘定位挡铁阀失电，挡板下降。当升降机下降到位后，如果满足排垛条件，则输送机将垛盘输送至下一垛盘输送位；否则垛盘将在此垛盘输送机上等待，这时声光报警器发出报警信号，通知叉车及时将垛盘叉走。当垛盘离开码垛位垛盘输送机后，托盘定位挡铁阀得电，挡板升起，将由托盘输送机输送过来的空托盘定位。每节垛盘输送机都有逐级缓停功能。"}}}, "操作界面": {"text": "操作界面包括操作盘及现场按钮盒。", "操作面板": {"text": "码垛机操作箱操作面板如图4-1所示，由一个触摸屏、一个钥匙开关、一个急停开关和三个平头按钮组成。下面分别介绍按钮及触摸屏界面。", "按钮开关": {"text": ""}, "触摸屏界面": {"text": "主画面码垛机触摸屏通电后即进入主画面如图4-2所示，该画面共有10个按钮，分别用于切换到相应的画面。主画面自动操作画面在主画面点击”自动操作”按钮即进入自动操作画面，如图4-3所示。该画面包括多状态指示灯，计数显示，当前故障显示，运行指示灯，画面切换按钮等部分。自动操作画面多状态指示灯：用于提示操作者生产线当前所处的状态，包括：系统自动运行状态!存在报警未清除！操作错误！系统手动操作状态!紧急停车！系统停止状态!请进行转位初始化!PLC系统故障!……计数显示：码垛速度—显示码垛机运行速度；总垛数—记录码垛机当前所完成的垛数；当前层数—码垛机当前垛上所码的层数；编组计数—显示当前所完成的编组袋数；转位计数—显示当前所完成的转位袋数。指示灯：用于显示所对应部机当前的状态，当指示灯为亮绿色时，表示所对应的部机正在运行；当指示灯为暗绿色时，表示所对应的部机处于停止状态。主画面、手动操作、事件历史按钮：用于切换到相应画面。子画面按钮：点击该按钮将弹出自动操作子画面。操作菜单按钮：单击操作菜单进入如图4-4所示。自动操作菜单画面零袋排出按钮：在自动运行状态下，按下此按钮，可将编组输送机、过渡板、分层板上的料袋假定为一层，码到垛盘上，将垛盘排出，同时层数计数器、编组计数器、转位计数器清零，垛数加“1”。强制排垛按钮：在自动运行状态下，按下此按钮，可以把当前垛盘强制排出，垛数加“1”，层数清零，其他计数不变。计数复位按钮：按下此按钮超过3秒钟，将清除“总垛数”计数。转位初始化按钮：在停止状态下，按下此按钮，伺服电机自动进行初始化操作，寻找初始位置。上游输送联锁按钮：选择系统是否向上游输出联锁信号。I/O监控画面在主画面点击“I/O监控”按钮，进入如图4-5所示。该画面列出了系统输入输出通道按钮。点击对应通道按钮就可以进入I/O点列表，查看I/O点当前状态。按下“输出测试”按钮可以进入输出点测试状态。按下“退出监控”按钮可以返回主画面。I/O监控画面工作参数设定画面在主画面点击“工作参数设置”按钮，弹出如图4-6所示，输入正确的用户名和密码，即可进入如图4-7所示。密码键盘画面工作参数设置画面工作参数查询画面工作参数查询画面如图4-8所示，主要内容包括码垛运行总垛数、码垛运行总时间、码垛机当前速度等。（若此系统中不包括输送检测部分，则金属拣出袋数及超差拣出袋数显示数值无效）工作参数查询画面手动操作画面当系统处于停止状态时，在主画面或自动操作画面，按“手动操作”按钮，进入手动操作主画面，如图4-10所示。点击图中各部机或部机名称即进入相应手动操作画面，如图4-11所示。在此画面中，可以手动操作各部机，也可以显示各个检测元件及执行元件的运行状态。手动操作画面手动操作画面T/C设置画面修改定时器设定值画面如图4-11所示，操作人员可以通过此画面修改PLC内部定时/计数器的设定值。修改参数部分由数值输入框组成，修改完成后，点击按钮即进入图4-12所示画面。可通过按钮上下翻页，点击返回主画面。定时器设置画面定时器/计数器操作画面系统参数配置系统参数配置画面图4-13所示，需要输入操作员密码。在该画面可以设定每垛层数，转位方向，转位方式、整形位置等参数。系统参数配置画面事件历史画面事件历史如图4-14所示，该画面记录最近所发生的事件信息。历史事件画面在历史事件画面或当前事件画面内输入故障代码00，进入相应故障帮助画面如图4-15所示，或直接按“系统帮助“按钮进入帮助画面，再使用”搜索“进入相应故障的帮助画面。码垛机触摸屏提示的已定义的000障代码帮助画面如图4-15所示，其它故障信息查询与此相同。具体故障信息列表详见故障操作章节。故障代码000文档信息画面在主画面点击“文档信息”即进入如图4-16所示，点击相应按钮将弹出相应品牌故障代码及说明信息。文档信息画面功能参数设定画面功能参数配置画面如图4-17所示，需要操作者输入密码。功能参数配置画面"}}, "现场按钮盒 ": {"text": "码垛机工作现场设置了3个按钮盒。", "斜坡输送机侧按钮盒": {"text": "在斜坡输送机立柱上设置了“停止”按钮盒，其按钮功能与操作箱操作面板的“停止”按钮相同。"}, "升降机框架上按钮盒": {"text": "在升降机框架上设置了“急停”按钮盒，其按钮功能与操作箱操作面板上“急停”按钮作用相同。"}, "托盘仓侧按钮盒": {"text": "在托盘仓叉车放置托盘侧设置了此按钮盒。其上按钮作用如下：“上升”按钮：当托盘等待位无托盘、托盘输送机停止运转时，按下此按钮，托盘托架升起。当托盘仓空仓，如果叉车放置托盘，必须按下此按钮，待托盘托架升起后，再放入空托盘。“下降”按钮：按下此按钮，托盘托架下降。"}}}, "逻辑详述": {"text": "", "料袋输送": {"text": "料袋输送部分包括斜坡输送机（根据生产线不同配置此部机可能为上斜坡输送机或下斜坡输送机或皮带输送机）、压平机、整形输送机和加速输送机四个部机。检测元件有斜坡光电：位于斜坡输送机出口处，整形输送光电：位于整形输送机出口处，加速输送光电：位于加速输送机出口处。关于斜坡光电、整形输送光电、加速输送光电安装位置调整，应保证光电的检测方向与输送机输送方向垂直，光电检测高度以输送料袋中部为最佳。"}, "转位编组": {"text": "", "转位": {"text": "转位部分包括转位输送机、料袋转位机和转位夹板阀。检测元件有转位光电：位于转位输送机中部，转位定位接近开关。关于转位光电开关安装位置调整，应保证光电放置在输送机中间位置，且光电发射端和接收端与输送机有一定倾斜角度，光电检测高度以输送料袋中部为最佳。"}, "缓停编组": {"text": "根据生产线实际配置选装此部机。检测元件有缓停编组光电：位于缓停编组机中部。关于缓停编组光电开关安装位置调整，应保证光电放置在输送机中间位置。"}, "编组": {"text": "检测元件有编组光电开关1：位于转位机（或缓停编组机）出口处，编组光电开关2：位于编组机入口处。关于编组光电开关1、编组光电开关2安装位置调整，首先需保证两个光电间距应小于一个料袋的宽度，若编组时料袋间的间距过大，可将编组光电开关1向编组机方向移动，反之向转位机方向移动，光电检测高度以输送料袋中部为最佳。"}}, "推袋": {"text": "推袋部分包括推袋电机和推袋推板阀。推袋机处共有8个接近开关，分别是推袋后位、推袋后位减速位、推袋中位减速位、推袋中位、推袋前位减速位、推袋前位、推板开位和推板关位。"}, "侧边整形、分层、压袋": {"text": "", "侧边整形": {"text": "侧边整形部分包括侧整形板机构和侧整形阀。检测元件有分层满光电：位于两侧侧整形板上。为保证分层满光电信号可靠，需将反射板式或对射式分层满光电两侧对正，保证在侧整形伸出缩回时，分层满光电不出现晃动。"}, "压袋": {"text": "压袋部分包括压袋机构和压袋阀。检测元件有压袋上位接近或磁环开关（以项目实际配置为准）,位于压袋机构上部。安装要求：当压袋阀返回至上位时，压袋上位处于ON状态。"}, "分层": {"text": "分层机包括分层机构和分层电机。在分层机下边缘同侧装有4个接近开关，分别是：分层开位、分层开减速位、分层关减速位、分层关位。分层开位和分层开减速位之间的距离、分层关位和分层关减速位之间的距离，不要过小，建议左右；同时根据物料的特性及码垛速度，适当调整分层关位的位置，使两块分层板之间的间隙适中。"}}, "升降": {"text": "升降机由垛1吊篮、升降配重和升降电机组成。在升降机下方配重导轨旁从上到下装有4个接近开关,分别是升降下降限位2 、升降机下降减速、升降机上升减速、升降上升限位2 ，在升降机下方吊篮侧导轨旁从上到下装有2个接近开关,分别是升降上升限位1 、升降下降限位1 ，同时在分层板下方的两个对角，分别装有1对对射式光电，均为上升临界光电。升降机的下限位2，用来保证确认当升降机降至低点时，升降机吊篮略低于垛盘1输送机平面，升降机的下限位1，用来对升降机下降至垛1排垛合适的高度再次作出检测确认。升降机的上升限位2，当使用托盘时升降机上升的最高点，升降机吊篮略低于分层机平面，升降机的上限位2，当仅使用纸板时升降机上升的最高点。分板下方的两个上升临界光电，两个光电信号串联来起来使用，临界光电与分层板之间的间隙，就是垛盘上升时顶层与分层板之间的距离。"}, "托盘仓、托盘输送、垛盘输送": {"text": "", "托盘仓": {"text": "托盘仓由托盘仓本体、托盘底缸阀和托盘叉阀组成。在托盘仓底缸阀旁有托盘仓底缸上位、托盘仓底缸中位2个接近开关，在托盘仓侧面装有托盘仓托盘检测光电开。托盘底缸上位、托盘底缸中位配合托盘底缸阀和托盘叉阀，将托盘逐个放入托盘输送机上。根据托盘底缸阀完全顶起时托盘底缸检测片的位置，确认托盘底缸上位位置，然后根据托盘底缸阀和托盘叉阀气缸的动作，调整托盘底缸中位位置。"}, "托盘输送机": {"text": "由托盘输送机组成。在托盘输送机上有托盘传送位、托盘等待位2个光电开关。当设备没有托盘等待位光电开关时，在接线盒处端子上将托盘传送位和托盘等待位两个信号短接。"}, "垛盘输送机": {"text": "垛盘输送机由垛盘输送机1和一组垛盘输送机组成，在垛盘输送机1上装有托盘定位挡铁阀。托盘定位挡铁气缸装有托盘定位挡铁下位，垛盘输送机1通过垛盘1光电开关定位托盘，垛盘输送机2及以后的每一节垛盘输送机均带有1个接近开关定位垛盘。托盘在垛盘输送机1的到位时间可由操作面板的触摸屏设定。垛盘输送机2以后的垛盘输送机数量需与操作面板设定参数一致。"}}}, "故障处理": {"text": ""}}, "称重控制系统": {"单元组成": {"text": "称重控制系统的组成框图如图1-1所示。各组成部分的作用如下：操作界面作为操作人员与设备之间的交互平台，接收来自操作人员的操作指令并指示设备的工作状态。称重控制器采集传感器输出的模拟信号，将模拟信号转换为数字信号，并运算处理，根据预设的工作模式与参数，得出逻辑控制信号。伺服驱动器、电磁阀作为控制元件，接收称重控制器逻辑控制信号，驱动给料门伺服电机、卸料门气缸动作，完成给料、卸料过程。检测元件用于检测运动机构的位置。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入控制柜后，经接线端子变径后至断路器。系统所有的控制元件、检测元件的工作电源均为DC24V，保证了人员操作的安全性。"}, "称重控制器": {"text": "本控制系统采用博实公司的ME型称重控制器，控制器的称重控制参数、重量判断参数及标定参数可根据实际应用进行设置。该控制器具有抗干扰性强、高稳定性，高精度等特点。", "参数设置：": {"text": ""}, "标定：": {"text": ""}}, "伺服驱动器": {"text": "伺服驱动器控制伺服电机，驱动给料门精确、高速、平稳开闭，完成给料称重过程。伺服驱动器的详细操作方法、参数设定及故障处理对策参阅其说明手册。"}}, "工作原理及控制过程": {"text": "电子定量秤为单秤结构，由一台称重控制器控制伺服驱动器，驱动给料门开闭向称重箱内给料称重，并根据允许卸料联锁信号的有无，控制卸料门开闭，完成卸料。控制过程为：启动称重控制器进入运行状态，若满足称重启动条件（秤料斗内无物料、给料门与卸料门关闭），开始称重，进行粗给料过程，给料门完全打开，物料快速落入称重料斗；当粗给料过程结束【1】，给料门关闭至精给料位置，进入精给料过程；当重量达到精给料阈值时，精给料过程结束，称重控制器控制伺服系统，将给料门完全关闭，称重结束（【1】粗给料过程的结束与“粗流控制”方式相关：若选择“时间控制”，达到设定的“粗流时间”，粗给料过程结束；若选择“重量控制”，达到“粗流阈值”，粗给料过程结束）。称重结束后，若称重控制器收到包装机的允许卸料信号，则输出秤卸料信号，卸料阀得电，卸料门打开卸料，经设定的卸料时间后，卸料阀失电，卸料门关闭。卸料门关闭到位，再次满足称重条件，进行下一次给料控制过程。卸料门打开时，卸料门关闭位检测开关为OFF，卸料门关闭到位后，关闭位检测开关转为ON。现场元件位置如图3-1所示，现场元件明细如表3-1所示。"}, "操作界面": {"text": "", "控制柜": {"text": "称重控制系统控制柜操作面板如图4-1所示。触摸式人机界面的详细操作见《ME2000A称重控制器使用手册》的操作指南部分。按钮指示灯功能如下："}, "触摸屏": {"text": "控制电源接通后，触摸屏进入如图4-2所示画面。自动运行画面硬件安装完毕检查确定无误后，系统通电，通电后系统首先进行相应初始化，之后自动进入自动运行画面。在运行参数设置与秤体标定完成状态下，在自动运行画面点击“启动称重”按钮，启动称重进入运行状态。称重操作主画面如图4-3所示。主画面主画面包括系统标定、自动运行、称重参数、统计信息、系统测试、关于等菜单。具体操作及参数设置等参见ME说明书。", "": {"text": ""}}}, "逻辑详述": {"text": "该部分包括给料电机，卸料阀。检测元件有卸料门关闭位磁环开关，给料初始位检测开关。"}, "故障处理": {"text": ""}}, "台车式包装机": {"单元组成": {"text": "包装控制系统组成框图如图1-1所示。各组成部分的作用如下：PLC(可编程控制器)是包装控制系统的控制中心。PLC自动循环扫描各个输入点的当前状态，并根据程序所确定的逻辑关系刷新输出点的状态，通过变频器、接触器和电磁阀来控制相应的电机的启停和气缸的动作，从而完成系统工艺流程的自动控制；操作面板作为操作人员与设备之间的交互平台，接收来自操作人员的操作指令并指示设备的工作状态；检测元件检测料袋的有无、位置/位移状态以及机械各部机和运动机构的动作状态；系统所使用的控制元件有伺服驱动器、变频器、接触器和电磁换向阀。接触器和电磁换向阀的控制线圈与PLC输出点相连。当接触器控制线圈得电，则接触器的触点接通，为电机供电；电磁换向阀用于切换气缸缸杆的伸缩状态，从而带动相应的机构完成相应的动作。变频器通过改变输出频率控制电机转速；伺服驱动器可以实现对伺服电机的速度、位置、转矩的控制。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入控制柜后，经接线端子变径后依次至总负荷开关、总断路器。总负荷开关为表面安装形式，带有旋转手柄，在不打开控制柜门的情况下，可方便地通过旋转手柄完成总电源的通断。每个电机回路均有单独的电机保护断路器对其进行保护，从而保证了电机的安全运行，并且便于在发生故障的情况下查找故障点。系统所有的控制元件、检测元件的工作电源均为DC24V，保证了人员操作的安全性。"}, "可编程控制器": {"text": "PLC(可编程控制器)是控制系统的核心。PLC 各通道输入输出点的使用情况如表2-1所示，表格中代号和名称栏空白为备用点。"}, "变频器": {"text": "系统中的缝纫机、夹口整形机、封口机、立袋输送电机由变频器驱动，变频器接收PLC的逻辑输出信号来控制电机的正反转及转速，使立袋输送电机、夹口整形电机和封口电机的速度与缝纫机的速度相匹配，从而达到良好的缝口效果。变频器的工作参数可通过变频器操作面板进行设置。详细操作方法、参数设定及故障处理对策等请参阅其说明手册。"}, "伺服驱动器": {"text": "包装控制系统采用一台伺服驱动器，用于控制横进台车的取袋、送袋往复动作。伺服驱动器的位置回路增益，往复运动的位移、速度以及电子齿轮等参数可通过个人计算机应用专用软件进行设定，然后下载到伺服驱动器，也可以通过操作面板手动写入。伺服驱动器的详细操作方法、参数设定及故障处理对策参阅其说明手册。"}, "触摸式人机界面": {"text": "系统配有触摸式人机界面（简称触摸屏），具有形象、直观，操作简单，便于系统维修和维护等特点，集以往操作面板中的各种按钮、指示灯、计数器、时间继电器、以及各种示意图于一体。"}}, "工作原理及控制过程": {"text": "包装控制系统控制物料装袋及封袋口、输送过程，以下将分别加以说明。", "供袋": {"text": "该部分包括供袋盘机构。供袋工位由两个储袋盘组成，分别称为A盘和B盘。控制过程为：当工作位储袋盘中包装袋用尽，则供袋盘阀得电，A、B盘实现换位，此时工作位储袋盘中有包装袋，则取袋机构正常取袋；如果A、B盘中都没有包装袋，则系统将给出储袋盘空报警提示，提醒操作人员向储袋盘中续放包装袋。"}, "取袋、送袋及抓袋": {"text": "该部分包括取袋机构、传送机构、分拣机构和抓袋机构。传送机构由电机驱动，其它机构动作均由气缸驱动，各气缸分别由电磁阀控制。控制过程如下：当处于工作位的储袋盘中有包装袋，取袋机构尚未取袋子，则取袋机构向下运动，取袋真空阀得电建立真空，当吸盘吸住包装袋后，取袋机构返回，到达取袋回位，取袋机构摆动至送袋位置，将空袋送入传送机构导向滚轮之间，取袋真空释放，取袋机构复位，空袋由导向滚轮带至斜板，沿斜板下滑；包装袋沿斜板下滑至下光电时，当料袋通过上光电后，表明包装袋已在斜板上定位，等待抓袋；当台车离开抓袋机构运动区域，抓袋机构向斜板运动，至抓袋抓位，抓袋吸盘贴近斜板，抓袋真空阀得电建立真空，吸住斜板上的料袋，返回竖直位置，等待台车取袋。"}, "台车取袋、送袋及开袋、装袋": {"text": "该部分包括横进台车，料门、开袋/抱夹机构、夹袋机构、吹袋装置和敦袋机构。台车在送袋位置和取袋位置之间往复运动。控制过程为：台车处于取袋位置，料门关闭状态则开袋/抱夹机构闭合，同时开袋真空阀得电建立真空，闭合到位后，开袋吸盘吸住包装袋后，抓袋真空释放，抓袋机构与包装袋脱离，台车开始送袋；当台车到达送袋位置，空袋到达料门下方，若开袋真空达到设定值，夹袋机构夹住袋口，并向检测管路内充压，夹袋机构内缩，开袋/抱夹机构打开，进行开袋 (若开袋真空释放，则夹袋机构不动作，开袋/抱夹机构打开，弃袋) ；当抱夹机构到达半开位时，如果包装袋夹持良好，则料门打开伸入袋口中 (包装袋没夹住或开袋不成功，则弃袋) ；包装系统会在适当时机向称重系统发出允许卸料信号，直到收到称重系统卸料信号，撤销允许卸料，并经过落料延时关闭料门，完成填充 (若定量秤未完成称重，则料门打开后，将等待定量秤投料) ；物料向包装袋内填装过程中，敦袋机构动作（敦袋次数可设定）；投料完成后，料门关闭，敦袋动作停止，敦袋机构停在上位，托住料袋底部，以便料袋由抱夹机构送入立袋输送机；当抱夹机构到达全开位时，台车动作回到取袋位置；完成一次循环。 "}, "夹口整形、缝口、立袋输送": {"text": "该部分包括夹口整形机、缝口机及立袋输送机，输送及缝纫动作由电机驱动，除缝口机、倒袋输送机外，其它各电机的转速均由变频器控制；缝纫机的断线切刀、倒袋装置由气缸驱动。控制过程如下：台车到达送袋位置，满袋被送至立袋输送机上，袋口进入夹口整形机，在立袋输送机输送下，料袋依次通过夹口整形机、缝口机。当料袋口经过切边装置时，切刀将料袋口多余的部分切除，使袋口上边沿平整。当料袋遮住吹纸边光电时，吹纸边机构利用仪表风将切下的纸边吹走。夹持装置夹紧纸带，随着滚轮的转动，将纸带向前输送。在折纸带位置，折成∩形的纸带将料袋口覆盖。纸带输送装置将料袋口和纸带压紧一起向前输送。当料袋依次进入缝纫机入口、出口光电检测区域时，缝纫机启动缝口；当料袋通过缝纫机出口光电后，缝纫机停止缝口，切刀切断缝纫线，完成一次料袋缝口过程。缝纫机线架上设置有断线检测机构，若判断断线故障，则系统停车报警。"}, "倒袋输送": {"text": "无动力倒袋：料袋在倒袋输送机上自然放倒。气缸倒袋：当料袋输送到倒袋光电开关位置时，倒袋电磁阀得电，带动推袋板动作，将料袋推倒。延时后，倒袋电磁阀失电，带动推袋板复位。旋转倒袋：倒袋检测光电检测到料袋，倒袋夹袋阀动作，夹袋机构夹住料袋；倒袋转袋阀动作，转袋同时，倒袋取袋阀动作，将料袋由取袋位向前输送，将料袋放倒。"}, "除尘": {"text": "本部分控制除尘器引风除尘、脉冲喷吹清灰的动作过程。系统启动，除尘风机开始运转，物料粉尘落入集尘斗，视集尘斗中的物料粉尘多少情况，由操作人员完成物料粉尘的清除及回收。根据一定时间内滤袋上的积尘量，可在脉冲控制仪上设置脉冲喷吹的脉冲宽度和间隔时间，以确保良好的过滤效果。设定的具体方法参见脉冲控制仪说明书。"}, "取样": {"text": "系统利用联锁信号(秤卸料信号)计数卸料袋数，达到取样选择的袋数或达到取样时间（触摸屏T/C设置画面中设置）时，取样缸杆伸出，进行取样。延时后，取样缸杆复位。"}}, "操作界面": {"text": "包装机操作界面包括控制柜、操作箱、按钮盒。", "控制柜": {"text": "在控制柜左侧壁的上部有总负荷开关手柄，正常情况下将手柄由“OFF”位拨至“ON”位，则控制柜通电，反之则断电。"}, "操作箱": {"text": "操作箱操作面板由触摸屏、钥匙开关、急停按钮和平头按钮组成。按钮指示灯功能如表4-1所示。", "触摸屏": {"text": "主画面包装机触摸屏通电后即进入主画面，如图4-1所示。该画面共有六个画面按钮，分别用于将系统切换到相应画面。主画面自动操作画面在主画面按“自动运行”按钮，或者启动条件满足的情况下，按动“启动”按钮，系统即进入自动运行状态并显示自动运行画面，如图4-2所示：自动运行画面多状态指示灯：用于提示生产线当前所处的状态，包括：自动运行存在报警停止状态操作错误！！紧急停车手动输送计数显示：分别为总袋数、总吨数、当前袋数和超差袋数以及金检袋数（备用）和包装速度的数值显示。“当前袋数”表示当前未完成吨的袋数；“超差袋数”表示重量复检秤检测到的超差总袋数；“金检袋数”表示金属检测器检测到的含金属的总袋数。在自动运行画面的中间上方为八个状态指示灯，左侧上方为当前故障显示，右侧为六个按钮，下面分别予以介绍。取袋真空指示灯：用于指示取袋真空检测结果。当取袋真空达到设定值时，该灯为亮绿色，否则为暗绿色。抓袋真空指示灯：用于指示抓袋真空检测结果。当抓袋真空达到设定值时，该灯为亮绿色，否则为暗绿色。夹袋检测指示灯：用于指示夹袋压力检测结果。当夹袋压力达到设定值时，该灯为亮绿色，否则为暗绿色。开袋真空指示灯：用于指示开袋真空检测结果。当开袋真空达到设定值时，该灯为亮绿色，否则为暗绿色。料门闭合指示灯：用于指示料门的开关状态。若料门为打开状态，则该指示灯为亮绿色；否则为暗绿色。料门无料指示灯：用于指示料门处是否有料，有料时该指示灯为亮绿色，否则为暗绿色。料仓无料指示灯：用于指示称重料斗内是否有物料。若有物料，则该指示灯为亮绿色；否则为暗绿色。码垛运行指示灯：用于指示码垛状态，在码垛运行状态时，该灯为绿色，否则为暗绿色。真空泵按钮：用于控制真空泵的启停。初始颜色为灰色，表示真空泵处于停止状态，当按钮切换为蓝色时，表示真空泵处于运行状态。秤联锁按钮：用于接通或断开包装机与定量秤的联锁。选通颜色为蓝色，断开为灰色。当设备调试时可将其选为断开，便于设备的调试。默认初始状态为选通。码垛联锁按钮：用于接通或断开包装机与码垛机的联锁。选通颜色为蓝色，断开为灰色。当需要包装机单独运行时，可将其选为断开。默认初始状态为选通。主画面为换画面按钮，点击进入主画面。计数清零按钮：用于清除当前显示数据。伺服电源按钮：用于接通或断开伺服驱动器电源。（注：若在初始设置中台车驱动方式选择“气缸”，此按钮显示为空白）伺服初始化按钮：用于启动伺服进行初始化操作。（注：若在初始设置中选择“气缸”，此按钮显示为空白）手动操作画面手动/测试画面如图4-3所示。在这个画面中，画面左侧为手动操作画面，右侧可选择通断时间。手动操作画面在手动操作画面中可以手动接通或断开夹袋阀、夹袋压力阀、开袋真空阀等，可以方便的对夹袋压力、开袋真空等进行测试，便于对夹袋压力开关的设定值进行设置。由于手动操作后，各个机构所处位置可能会对自动运行造成安全隐患，因此当系统处于自动运行时将不能进行测试，并请注意在退出手动操作画面前，须确认各个机构均处于正常位置！ I/O监控画面在主画面中点击“I/O监控”按钮，即进入如图4-4所示画面，PLC监控画面上的按钮对应PLC上相应的输入输出模块及内部地址，在监控状态下，按动按钮，可进入相应的输入输出模块监视各个输入输出信号的开关状态。输入监控：通过对输入通道的监视，可以方便的检查各个输入信号的状态，对检测开关接线进行校对，以及对检测开关是否出现故障进行判断。例如输入监控画面，如图4-4所示；其中Ix.x（x代表数字）为相应的输入地址，地址右侧与之对应的是该地址的输入状态指示灯及中文名称，指示灯为绿色表示相应的输入处于接通状态，指示灯为白色表示相应的输入处于未接通状态。输入监控画面输出监控画面输出监控：通过对输出点的强制，可以方便的检查各个执行机构的动作是否正确，对接线进行校对，以及对故障进行判断。例如输出监控画面，如图4-5所示；其中Qx.x（x代表数字）为相应的输出地址，地址右侧与之对应的是该地址的控制按钮及中文名称，即当按下按钮时，按钮颜色变为绿色，相应输出点状态变为接通，其对应的执行机构应当动作，释放按钮后，颜色恢复白色，对应的输出点恢复断开状态。参数设定画面在主画面点击“系统配置”按钮，弹出密码验证画面，输入正确的用户名和密码即可进入如图4-6所示画面。在此画面中可设置投料方式等工作模式，对包装机部分机构使用情况与工作方式进行选择。参数设定画面由于本设置在初次调试时已设定好，无需操作员再次设定，按即可。T/C设置画面T/C设置画面如图4-7所示，操作人员可以通过此画面修改PLC内部与系统运行相关的部分的定时/计数器的设定值。画面中第一列为对应的定时器号及设置/显示框，用于设定及显示定时器的时间值；第二列是对定时器的进一步说明。T/C设置画面事件查询画面事件查询画面如图4-8所示，包括报警内容、报警发生时间等，便于对系统运行状态进行分析。按“退出”按钮，将切换到自动运行画面，按“故障帮助”按钮，将切换到故障帮助画面。事件查询画面系统设定画面系统设定画面如图4-9所示。系统设定"}}, "按钮盒": {"text": "", "缝纫机处按钮盒": {"text": "“断线故障”指示灯：当缝纫机发生断线或线用尽时，灯亮。“停止”按钮：此按钮功能与操作面板上的“停止”按钮相同。“缝纫机闸手动释放” 选择开关：用于在包装机停止状态下将缝纫机电机的制动器释放，便于穿线及维修等操作。该开关处于释放位置（指向右侧）时，包装机将不能自动运行或手动输送；若在包装机运行时将此开关拨至释放位置，则包装机停止运行；若发生断线故障，可通过此开关复位。“手动输送正向/停/反向” 三位选择开关：该开关由停止位拨至正向时，启动输送机正向运行，在包装机停止状态下将料袋送到码垛机；该开关由停止位拨至反向时，将启动输送机反向运行，便于发生故障（如袋口堆挤）时，将料袋反向送出。该开关未处于停止位时，包装机不能进入自动运行状态，包装机自动运行时，将该开关拨离停止位，将使包装停止自动运行。“备用”按钮：备用。"}, "除尘按钮盒": {"text": "“除尘启动”按钮：用于启动除尘风机和脉冲控制仪，使脉冲控制仪按照预置的脉冲宽度和间隔时间控制脉冲阀喷吹清灰。“除尘停止”按钮：用于停止除尘风机和脉冲控制仪的运行。“急停”红色蘑菇头按钮：按下按钮，使系统进入紧急停车状态。此按钮带自锁，转动复位。"}, "": {"text": ""}}}, "逻辑详述": {"text": "", "取袋、送袋及抓袋": {"text": "该部分包括供袋电机，取袋阀、取袋真空阀、送袋阀、抓袋反吹阀、举袋阀、抓袋阀、抓袋真空阀。检测元件有取袋回位磁环开关、送袋送位磁环开关、抓袋抓位磁环开关、抓袋回位磁环开关，斜板上光电、斜板下光电，取袋真空检测开关。"}, "台车取袋、送袋、开袋、装袋": {"text": "该部分包括台车阀(A取袋/B送袋) [伺服电机驱动台车为电机]，抱夹阀(A开阀/B关阀)、开袋真空阀，敦袋阀、吹袋阀、抱夹阀(A开阀/B关阀)、夹袋阀、夹袋压力阀、缩口阀、料门阀、二次料门阀、过渡斗气锤阀(A阀/B阀)。检测元件有抓袋回位磁环开关、举袋到位磁环开关，取袋位置接近开关、送袋位置接近开关、抱夹闭合位接近开关、抱夹半开位接近开关、抱夹全开位接近开关，夹袋到位磁环开关，开袋真空检测开关、夹袋压力检测。"}, "夹口整形、封口、立袋输送": {"text": "该部分包括缝纫电机(含缝纫机闸)、夹口整形电机、热封电机(折边电机)、立袋输送电机，切线阀、吹纸边阀。检测元件有缝纫机入口光电、缝纫机出口光电，缝针断线检测接近开关、钩针断线检测接近开关。"}, "倒袋输送": {"text": "", "气缸倒袋": {"text": "该部分包括倒袋阀。检测元件有倒袋位置检测光电开关。"}, "旋转倒袋": {"text": "该部分包括倒袋夹袋阀、倒袋转袋阀。检测元件有倒袋位置检测光电开关；倒袋夹袋位、倒袋取袋位磁环开关。"}}, "除尘": {"text": "该部分包括除尘电机，喷吹阀。检测元件有压差控制器(选装)。"}, "取样": {"text": "该部分包括取样阀。"}}, "故障处理": {"text": ""}}, "输送检测": {"单元组成": {"text": "输送检测控制系统组成框图如图1-1所示。各组成部分的作用如下：可编程控制器是系统的控制中心。PLC自动循环扫描各个输入点的当前状态，并根据程序所确定的逻辑关系刷新输出点的状态，通过接触器和电磁阀来控制电机的启停和气缸的动作，从而完成系统的自动控制。金属检测器用于检测料袋中是否含有磁性金属（铁）、非铁磁性金属（铝，铜）、非铁磁性不锈钢等物质。具体技术说明参阅金属检测器用户手册。复检秤控制器用于检测料袋重量是否合格。它采集称重传感器输出的模拟信号，将其转换成重量数值，与人工设定的重量合格上下限进行比较，比较完成后输出重量合格或超差信号。检测元件用于检测机构或料袋的位置。操作面板作为操作人员与设备之间的交互平台，接收来自操作人员的操作指令并指示设备的工作状态。系统所使用的控制元件有接触器和电磁阀。接触器和电磁阀的控制线圈与PLC输出点相连。当接触器控制线圈得电，则接触器的触点接通，为电机供电；电磁阀用于切换气缸缸杆的伸缩状态，从而带动相应机构完成相应动作。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC 220/380V，三相五线制）进入控制柜后，经接线端子变径后至总断路器。每个电机回路均有单独的电机保护断路器对其进行保护，从而保证了电机的安全运行，并且便于在发生故障的情况下查找故障点。系统所有的控制元件、检测元件的工作电源均为DC24V，保证了设备运行及人员操作的安全性。"}, "可编程控制器": {"text": "PLC输入输出点的使用情况如表2-1所示，表格中项目代号和名称栏空白为备用点。"}, "复检秤控制器": {"text": "技术说明参阅电子复检秤用户手册。"}, "金属检测器": {"text": "技术说明参阅金属检测器用户手册。"}, "批号打印机": {"text": "技术说明参阅批号打印机用户手册。"}}, "工作原理及控制过程": {"text": "本部分实现的功能：料袋的并线输送、重量检测、金属检测、不合格料袋下线。检测元件有：1#倒袋检测、2#倒袋检测、3#倒袋检测、重检入口、重检出口、金检出口、1#倒袋回位、2#倒袋回位、3#倒袋回位、拣选入口、拣选堆袋、倾斜拣选检测、批号打印检测、拣选回位、1#出口检测开关、2#出口检测开关、3#出口检测开关。控制过程为：1#包装机、2#包装机、3#包装机输送来的料袋分别进入1#、2#、3#倒袋输送机，并线后，经输送进入金检输送机、重检输送机、拣选输送机、过渡输送机。封口完毕的料袋进入倒袋输送机。无动力倒袋：无倒袋检测光电，无倒袋电磁阀。有动力倒袋(倒袋检测位于在输送机入口处)：当料袋输送到倒袋光电开关位置时，倒袋光电开关为ON，当ON再转为OFF延时后，倒袋电磁阀得电，带动推袋板动作，将料袋推倒。延时后，倒袋电磁阀失电，带动推袋板复位。有动力倒袋(倒袋检测位于在输送机中间位置)：当料袋输送到倒袋光电开关位置时，倒袋光电开关为ON延时后，倒袋电磁阀得电，带动推袋板动作，将料袋推倒。延时后，倒袋电磁阀失电，带动推袋板复位。并线方式。有动力倒袋占先并线：若2#倒袋检测光电处先检测到料袋，此时3#出口检测光电处也检测到料袋，则3#输送机逐级缓停。直到2#料袋完全离开2#倒袋检测光电一定时间后，3#输送机才启动运行。若3#出口检测光电先检测到料袋，此时2#倒袋检测光电处也检测到料袋，则3#输送机输送的料袋占先，2#料袋输送到达倒袋位后缓停。直到3#料袋完全离开3#出口检测光电一定时间后，2#倒袋阀才伸出。1#和2#并线同理。有动力倒袋插空并线：2#（3#）输送机输送的料袋不因并线缓停，当2#（3#）出口检测光电OFF延时一定时间后，1#倒袋阀才可伸出倒袋（即当1#输送机输送料袋到达倒袋位时，如果2#（3#）出口检测光电ON或者OFF时间没到时，料袋在倒袋位缓停。直到2#（3#）料袋完全离开2#（3#）出口检测光电一定时间后，1#倒袋阀才伸出）。 非倒袋处占先并线：若2#出口检测光电处先检测到料袋，此时3#出口检测光电处也检测到料袋，则3#输送机逐级缓停。直到2#料袋完全通过出口检测光电一定时间后，3#输送机才启动运行。若3#出口检测光电先检测到料袋，则2#输送机输送的料袋占先，2#输送机逐级缓停。直到3#料袋完全通过出口检测光电一定时间后，2 #输送机才启动运行。   1#和2#并线同理。料袋在经过整形压平输送过程中将内部物料压展均匀，以便进入金属检测器及重量复检秤进行金属颗粒含量和包装重量的检测。在金属检测输送机的输送过程中，金属检测器对料袋进行金属颗粒检测，当检测到料袋内含有金属颗粒时，检测器向PLC发出报警信号。金属检测器的灵敏度可以根据现场的实际情况设定；不同检测产品可以通过金属检测器操作界面进行学习。当料袋完全进入重检输送机后（即重检入口光电开关由OFF转为ON再转为OFF，重检出口光电开关为OFF），称重控制器对料袋进行采样称重，称重结果显示在显示屏上，同时将称重结果与设定的合格范围相比较，得出判断结果。如果超差则发出报警信号，同时将报警信号传送给PLC。不合格料袋剔除。气缸顶起电机剔除：当含金属料袋或重量超差料袋（PLC记忆跟踪）到达拣选位置，拣选输送机暂停，拣选气缸驱动拣选机构向上伸出，由PLC控制拣选电机正转或反转，分别向两侧剔除料袋。拣选气缸回位磁环开关转为ON时，拣选输送机恢复运转。电机刮板剔除：当含金属料袋或重量超差料袋（PLC记忆跟踪）到达拣选位置，拣选输送机暂停，由PLC控制拣选电机正转或反转，带动拣选板分别向两侧剔除料袋。拣选回位光电为ON时，拣选输送机恢复运转。大气缸单侧剔除：当含金属料袋或重量超差料袋（PLC记忆跟踪）到达拣选位置，拣选输送机暂停，拣选气缸驱动拣选机构侧向伸出，剔除不合格料袋。拣选气缸回位磁环开关转为ON时，拣选输送机恢复运转。气缸顶起输送机倾斜剔除：当含金属料袋或重量超差料袋（PLC记忆跟踪）到达拣选位置，拣选输送机暂停，拣选气缸驱动拣选机构升起倾斜，剔除不合格料袋。拣选气缸回位磁环开关转为ON时，拣选输送机恢复运转。合格的料袋直接通过拣选输送机、过渡输送机，经批号打印后进入自动码垛单元。如果料袋有破包撒料现象，过渡输送机上配置的撒料检测光电开关将发出信号，系统将报警提示人工处理。如果在拣选机处有拣选堆袋现象，堆袋检测光电开关将发出信号，系统将报警提示人工处理。控制回路电路图参阅电气图册。"}, "操作界面": {"text": "", "触摸屏界面": {"text": "主画面输送触摸屏通电后即进入主画面如图4-1所示。该画面共有八个按钮，分别用于切换到相应的画面。主画面自动操作画面在主画面点击“自动操作”按钮进入自动操作画面，如图4-2所示，该画面包括多状态指示灯，计数显示，画面切换按钮等部分。自动操作画面多状态指示灯：用于提示操作者生产线当前所处的状态，包括：自动运行！联锁停车！故障停车！检出金属！重量超差！金检停车！紧急停车！金检部分停车！计数显示：金（金属袋数）—显示金属检测器检测到含金属的总袋数。重（超差袋数）—显示重量复检秤检测到的超差总袋数。总计-显示输送料袋的总袋数。此组数据可以通过“计数复位”按钮清零。按住“计数复位”按钮保持3秒可清零。系统联动/调试按钮：用于系统调试和系统联动之间的转换。在系统上电后，屏上默认设置为联动状态。系统设置为调试状态时，输送检测单元独立运行，不受外部设备启停控制，此时屏上手动操作无效；若处于联动状态，输送检测单元将根据外部设备的联锁信号而启停。“手动操作”“历史故障”“主画面”为换画面按钮。手动操作画面手动操作画面如图4-3所示。只有在联锁停车状态下才能进行手动操作。在此画面中可以手动接通或断开接触器、电磁阀、声光报警器等执行元件。手动操作画面参数设置画面在主画面点击“参数设定”按钮， 进入图4-4所示的画面。该画面可设置报警处理方式及倒袋方式等内容。参数设定画面T/C设置画面在主画面点击“T/C设置”按钮，进入如图4-5所示画面，操作人员可以通过此界面修改PLC内部与系统运行相关的部分的定时/计数器的设定值。T/C设定画面I/O监控画面I/O监控画面如图4-6所示。点击输入或输出点监控进入相应I/O点列表，查看I/O点当前状态。I/O监控画面输入信号画面输出信号画面输入通道：通过对输入通道的监视，可以方便的检查各个输入信号的状态，对检测开关接线进行校对，以及对检测开关是否出现故障进行判断。例如输入通道，如图4-7所示。其中Ix.x（x代表数字）为相应的输入地址，地址右侧与之对应的是该地址的输入状态指示灯及中文名称，指示灯为亮色表示相应的输入处于接通状态，反之则处于未接通状态。输出通道：通过对输出通道的监视，可以方便的检查各个输出信号的状态，对执行元件接线进行校对，以及对故障进行判断。例如输出通道，如图4-8所示。其中Qx.x（x代表数字）为相应的输出地址，地址右侧与之对应的是该地址的输出状态指示灯及中文名称，指示灯颜色为亮色表示相应输出点状态变为接通，其对应的执行机构应当动作，反之则处于断开状态。事件查询画面在主画面点击“当前故障”按钮，即可进入当前事件查询画面，如图4-9所示。在当前事件查询画面或主画面点击“历史事件”按钮，即可进入历史事件查询画面，如图4-10所示。当前事件查询画面历史事件查询画面在主画面点击“故障帮助”按钮，输入“故障代码”进入相应的故障帮助画面。具体故障信息列表详见故障操作章节。故障代码01"}, "操作按钮": {"text": "故障确认带灯按钮：当有故障报警发生时灯亮；按下按钮，清除当前的故障。急停按钮：正常时处于释放状态，按钮按下时锁定，输送控制系统进入紧急停车状态。在此状态下，输送设备全部停止运行且无法启动。当急停按钮旋转释放后，待人工故障确认后，急停状态解除，设备可正常启动。"}, "拉绳开关": {"text": "为了便于处理意外情况，在整形压平输送机和重检输送机之间设置了拉绳开关。拉动拉绳开关，输送控制系统进入紧急停车状态，在此状态下，输送设备全部停止运行且无法启动。当拉绳开关复位释放后，急停状态解除，设备可正常启动。"}}, "逻辑详述": {"text": "", "1#倒袋输送": {"text": "检测元件包括1#倒袋检测开关、1#倒袋回位检测开关。"}, "2#倒袋输送": {"text": "2#料袋输送部分包括2#倒袋输送机。检测元件包括2#倒袋光电、2#倒袋气缸回位接近开关。"}, "3#倒袋输送": {"text": "3#料袋输送部分包括3#倒袋输送机。检测元件包括3#倒袋光电、3#倒袋气缸回位接近开关。"}, "金属检测": {"text": "金属检测部分包括金属检测器和金检输送机。检测元件有金检出口光电:位于金检输送机出口处，金属检测器：位于金检输送机中部。"}, "重量检测": {"text": "重量检测部分包括重量检测输送机。检测元件有重检入口光电:位于重检输送机入口处，重检处口光电:位于重检输送机处口处。"}, "不合格剔除": {"text": "不合格剔除部分包括拣选输送机和拣选电机（拣选阀）。"}}, "故障处理": {"text": "报警对应信息（以系统实际配置为准）："}}, "除尘控制系统": {"单元组成": {"text": "除尘控制系统由除尘风机电机和脉冲控制仪回路组成。控制原理图详见随机电气图册。"}, "单元配置特点及技术说明": {"text": "", "电源部分": {"text": "现场动力电源（AC220/380V，三相五线制）进入除尘控制箱后，经接线端子变径后至断路器。除尘风机有单独的电机保护断路器对其进行保护，从而保证了电机的安全运行。"}}, "工作原理及控制过程": {"text": "本控制系统控制除尘器引风除尘、脉冲喷吹清灰的动作过程。除尘系统启动，除尘风机开始运转，物料粉尘落入集尘斗，视集尘斗中的物料粉尘多少情况，由操作人员完成物料粉尘的清除及回收。根据一定时间内滤袋上的积尘量，可在脉冲控制仪上设置脉冲喷吹的脉冲宽度和间隔时间，以确保良好的过滤效果。设定的具体方法参见脉冲控制仪说明书。除尘控制系统现场元件布置如图3-1所示；现场元件明细如表3-1所示。"}, "操作界面": {"text": "", "控制柜": {"text": "操作界面如图4-1所示；操作盘上的操作元件功能说明如表4-1所示。"}}, "逻辑详述": {"text": "该部分包括除尘电机，喷吹阀。检测元件有压差控制器(选装)。"}, "故障处理": {"text": ""}}}